{
    "0_0": "To find it we take the street which leads off from the far left-hand corner of the square and follow it to the first intersection.\n\n\nThe soup master placed his enormous hands on the table and sank his weight onto the stool.\n\n\nNalan finds an empty coffee cup, extinguishes her cigarette, and stirs sugar noisily.\n\n\nKa watched the snow on the awning, brewed coffee with perfect foam, and fought off an aggressor with garbage.\n\n\nKa watched the snow on the awning, brewed coffee with perfect foam, and fought off an aggressor with garbage.\n\n\nKa watched the snow on the awning, brewed coffee with perfect foam, and fought off an aggressor with garbage.\n\n\nNalan found an empty coffee cup and stubbed out the cigarette.\n\n\nShe removed the pot from the burner as soon as the coffee started to swell, filled the cups halfway, and then returned the pot to the flame in order to create a perfect foam.\n\n\nThrough the window, I glimpsed bicycle shops near a station.\n\n\nThe soup master settled on a stool, hands on the table.\n\n\nNalan found an empty coffee cup and stubbed out the cigarette.\n\n\nShe removed the pot from the burner as soon as the coffee started to swell, filled the cups halfway, and then returned the pot to the flame in order to create a perfect foam.\n\n\nTo find it we take the street which leads off from the far left-hand corner of the square and follow it to the first intersection.\n\n\nThe soup master placed his enormous hands on the table and sank his weight onto the stool.\n\n\n[4] The soup master placed his enormous hands on the table and sank his weight onto the stool.\n\n\n[6] To find it we take the street which leads off from the far left-hand corner of the square and follow it to the first intersection.\n\n\n[4] The soup master placed his enormous hands on the table and sank his weight onto the stool.\n\n\n[6] To find it we take the street which leads off from the far left-hand corner of the square and follow it to the first intersection.\n\n\n[4] A fat boy pedaled his bicycle in their direction.\n\n\n[7] A purpose-built glass cube at the back has a small café menu, while an upstairs restaurant offers cuisine with Italian and Turkish inﬂuences.\n\n\n[3] Nalan found an empty coffee cup and stubbed out the cigarette.\n\n\n[4] On the billboard in front of the National Theater a poster announced that evening’s performance.\n\n\n[3] A fat boy pedaled his bicycle in their direction.\n\n\n[8] A purpose-built glass cube at the back has a small café menu, while an upstairs restaurant offers cuisine with Italian and Turkish inﬂuences.\n\n\nOn the billboard in front of the National Theater a poster announced that evening’s performance.\n\n\n[1] Nalan found an empty coffee cup and stubbed out the cigarette.\n\n\nHe ushered her up a plank and into a wooden crate placed on a cart.\n\n\n[5] The waiter took their selections directly from the tray and set them on the table.\n\n\n[2] A purpose-built glass cube at the back has a small café menu, while an upstairs restaurant offers cuisine with Italian and Turkish inﬂuences.\n\n\nNalan found an empty coffee cup and stubbed out the cigarette.\n\n\n[5] On the billboard in front of the National Theater a poster announced that evening’s performance.\n\n\n[1] He ushered her up a plank and into a wooden crate placed on a cart.\n\n\nThe waiter took their selections directly from the tray and set them on the table.\n\n\n[6] He ushered her up a plank and into a wooden crate placed on a cart.\n\n\na cozy corner with tea glasses and a library table, a cart with a wooden crate and a plank, wooden shelters by lantern light, ornate, decorative, unique, exquisite.\n\n\nThe soup master placed his enormous hands on the table and sank his weight onto the stool.\n\n\n[1] The waiter took their selections directly from the tray and set them on the table.\n\n\nThe waiter took their selections directly from the tray and set them on the table.\n\n\nTable_237 : The soup master placed his enormous hands on the table and sank his weight onto the stool.\n\n\nNalan grabbed an empty coffee cup and extinguished her cigarette.\n\n\nA poster for the evening’s performance adorned the billboard in front of the National Theater.\n\n\nThrough the window, a row of bicycle and car repair shops was visible.\n\n\nCoffee_02 : Nalan found an empty coffee cup and extinguished her cigarette.\n\n\nHe guided her onto a plank and into a wooden crate on a cart.\n\n\nA street lined with bicycle and car repair shops unfolded.\n\n\nAn upstairs restaurant with Italian-Turkish fusion and a small café in a glass cube were highlights.\n\n\nA glass cube at the back serves as a café, while an upstairs restaurant offers Italian-Turkish fusion.\n\n\nOut the window, I spotted a row of bicycle and car repair shops.\n\n\nNalan finds an empty coffee cup, stubbing out a cigarette.\n\n\nPick the top 3 nouns, as they contain higher possibilities compared to other contents.\n\n\nTake the top 3 nouns as inputs to ask chatGPT, in this order, to list 3 tactile adjectives related to each noun.\n\n\nPick the top 3 nouns, as they contain higher possibilities comparing to other contents.\n\n\nTake the top 3 nouns as inputs to ask chatGPT, in this order, to list 3 tactile adjectives related to each noun.\n",
    "0_1": "Fascinated, I held my mother’s hand and gazed at the captivating displays in shop windows.\n\n\nFascinated, I held my mother’s hand and gazed at the captivating displays in shop windows.\n\n\n[4] We avoid his gaze and take a table on the opposite side of the room, but he picks up his cup and saucer and comes over.\n",
    "0_2": "In Orhan Pamuk’s “The Museum of Innocence,” Kemal Basmaci, a wealthy Istanbul businessman, falls in love with his distant cousin, Fusun.\n\n\nThe novel revolves around a physical museum that Kemal creates to display objects associated with his relationship with Fusun.\n\n\nThe museum not only pays tribute to Kemal’s relationship with Fusun but also preserves Istanbul’s history.\n\n\nThe commencement exercises of the college were held in the large audience-rooms and the adjoining balcony overlooking the Bosphorus.\n\n\nThe commencement exercises of the college were held in the large audience-rooms and the adjoining balcony overlooking the Bosphorus.\n\n\nThe Osmanlı Bankası Müzesi entrance displays “Bankalar Cad 35–37, Karaköy” in bold letters.\n\n\nThe museum opened in 2012, accompanied by The Innocence of Objects catalogue.\n\n\nThe Osmanlı Bankası Müzesi entrance displays “Bankalar Cad 35–37, Karaköy” in bold letters.\n\n\nThe museum opened in 2012, accompanied by The Innocence of Objects catalogue.\n\n\n[6] The türbe communicates by a large grilled opening to a small wooden mosque with a baroque wooden dome.\n\n\n[1] It is also the location for a thriving r Rahmi M Koç Museum bar and café scene, which in the summer especially is the hub of Istanbul’s nightlife.\n\n\n[3] It is also the location for a thriving r Rahmi M Koç Museum bar and café scene, which in the summer especially is the hub of Istanbul’s nightlife.\n\n\nCorner: sebil with grilled openings, palatial türbe resembling small mosque.\n\n\nKoca Mustafa Paşa mosque entrance, sebil with grilled openings, palatial türbe.\n\n\nCorner: sebil with grilled openings, palatial türbe resembling small mosque.\n\n\nKoca Mustafa Paşa mosque entrance, sebil with grilled openings, palatial türbe.\n\n\nRahmi M Koç Museum thrives—a bar, café, and summer night hub.\n\n\nThe türbe connects to a small wooden mosque with a baroque wooden dome through a large grilled opening.\n\n\nDisplay of tractor tires and exhaust pipes on the Athens-to-Sparta highway.\n\n\nAlso it served as a museum for several decades, however recently Hagia Sophia has been turned back into a mosque.\n",
    "0_3": "illuminated movie billboard, carpets aside, mosaic glass tiles, ochre and jade green, brown awning.\n\n\nALTAT TOMATOES, a large billboard proclaimed, amid gardens, fields of sunflowers, little farmhouses.\n\n\nBillboard_03 : Amid gardens, fields of sunflowers, and quaint farmhouses, a large billboard proudly proclaims “ALTAT TOMATOES.\n\n\nThese draperies are positioned around the wandering path and display movie clips related to the current fragment's constructed scene.\n\n\nThese movie clips also come from the Istanbul Film Archive.\n",
    "0_4": "Beyond the hamam, Itfaiye Caddesi widens and becomes quite pretty, with a double row of plane trees shading the open stalls of a colourful fruit and vegetable market.\n\n\nshade beneath the door’s awning, modern , iron pontoon structure, next to the door, postcard view, slender minarets, domes, kite tail.\n\n\nHe walked up and down the street twice; at one end was a group of children throwing snowballs, at the other a huge illuminated movie billboard showing a nondescript woman whose eyes had been blacked out, blinded.\n\n\n[4] He walked up and down the street twice; at one end was a group of children throwing snowballs, at the other a huge illuminated movie billboard showing a nondescript woman whose eyes had been blacked out, blinded.\n\n\n[8] Daphne stepped into the shade beneath the door’s awning.\n\n\nitalian-turkish chair next to the door, stool next to her dressing table, shade beneath the door’s awning, pudding and coffee, glass cube at the back, small café menu.\n\n\nSo the voice can be talking about this and that while you’re walking underneath a subway bridge in 2005.\n\n\nSome idea of its extraordinary size and traffic, however, came to light in 2004, when a plan to lay a subway line and station through Yenikapı was abruptly halted by the discovery of numerous shipwrecks buried in the earth.\n\n\nHe walked past children throwing snowballs and a billboard depicting a blinded woman.\n\n\nTo escape cars and crowds, we walked to the other end of Rumelihisarı, witnessing an Ottoman mansion in flames.\n\n\nHall describes the impact of cybernetic thinking on urban planning, a development that he terms ‘cybernated planning’ (Hall, 1992, p.\n\n\nThis emerged out of traditional, formalist ideas of planning as production of plans for the future desired state of the area and ‘towards the new idea of planning as a continuous series of controls over the development of the area, aided by devices which seek to model or simulate the process of the development so that this control can be applied’ (Hall, 1992, p.\n\n\nHowever, its unprecedented challenge is daunting, and any attempt to grasp this all-encompassing space through words and texts is impossible and ends in despair.\n\n\nTo ensure the viewer's experience is the same as when watching a movie, the relative distance between the camera path and the line of sight focus remains unchanged.\n",
    "0_5": "On the hill, above the shore-line, the Seraglio, Sera, and its square tower picturesquely situated amongst the trees, with the Baghdad Kiosk and Column of Claudius to the l.\n\n\nIndulge in flavorful kebabs at Mabeyin, perched in the scenic hills above the Bosphorus Bridge, while immersing yourself in the allure of ancient mosques, architectural marvels, vibrant markets, and the mesmerizing sight of the fountain, as Selim’s gaze remains fixed on the grand mosque complex taking shape in Edirne from the serenity of the Harem.\n\n\nIndulge in flavorful kebabs at Mabeyin, perched in the scenic hills above the Bosphorus Bridge, while immersing yourself in the allure of ancient mosques, architectural marvels, vibrant markets, and the mesmerizing sight of the fountain, as Selim’s gaze remains fixed on the grand mosque complex taking shape in Edirne from the serenity of the Harem.\n\n\nNearby, a stall displayed an arrangement of goods, including bread and other treats.\n\n\nNearby, a stall displayed an arrangement of goods, including bread and other treats.\n\n\n[1] It occupies the site, however, of a mosque by Sinan which was founded by Süleyman the Magnificent in memory of his hunchback son Cihangir, who died in 1553 from sorrow, it is said, for his half-brother, the unfortunate Prince Mustafa, whom their father had just executed; Prince Cihangir was buried in the türbe of his other brother Mehmet at the Şehzade.\n\n\nIt occupies a site of a mosque by Sinan, founded by Süleyman the Magnificent in memory of his hunchback son Cihangir.\n\n\nHere, take the example of a kebab stall in Istanbul.\n",
    "0_6": "; and the Chinili Kiosk, Musewm of Antiquities, and the Serai Walls running from Yali Kiosk Kapusi to the Marmara.\n\n\nA staircase in the garden led to a subterranean kiosk under the New Kiosk, and also connected with little iron gates by which a hasty escape could be made to the Marmora.\n\n\nAt the mouth of the stream is the Imperial Kiosk, built by the Valideh Sultan, mother of Abdul Mejid, in the same style as the Dolmabaghcheh Palace, on the site of an earlier kiosk erected by Mahmftid JI.\n\n\nPlaced the harbour at a distance of 104 feet to the south of Indjili Kiosk, consistently with his opinion that the ruins discovered behind that Kiosk marked the site of the Palace of the Bucoleon.\n\n\nBetween the Sinan Agha Kiosk and the boathouses was another kiosk, not at the water’s edge, but built high on the Seraglio wall, which at this point was a considerable way inland.\n\n\nInternally the kiosk is divided into three main rooms leading out of each other, the wall kiosk itself being part of the centre.\n\n\nThe 2nd Gate, Yali Kiosk Ka- pust, is named after the handsome kiosk of Suleiman the Magnificent.\n\n\nDelicious kebab restaurant in the hills above the Bosphorus Bridge.\n\n\nThe mosque had nearby buildings, including an imaret, medrese, and mektep.\n\n\nThe mosque had nearby buildings, including an imaret, medrese, and mektep.\n\n\nThe mosque had nearby buildings, including an imaret, medrese, and mektep.\n\n\nDelicious kebab restaurant in the hills above the Bosphorus Bridge.\n\n\n[3] Delicious kebab restaurant in the hills above the Bosphorus Bridge.\n\n\n[3] Delicious kebab restaurant in the hills above the Bosphorus Bridge.\n\n\n[2] To dispel the drowsiness she had made a cup of coffee for herself and now she stirred the sugar, clinking her spoon noisily against the porcelain.\n\n\n[1] The kebabs in this informal gourmet restaurant are wonderful – the salads and meze are worth a look, too.\n\n\n[1] To dispel the drowsiness she had made a cup of coffee for herself and now she stirred the sugar, clinking her spoon noisily against the porcelain.\n\n\n[1] Delicious kebab restaurant in the hills above the Bosphorus Bridge.\n\n\nDelicious kebab restaurant in the hills above the Bosphorus Bridge.\n\n\nShe stirred sugar into her own cup of coffee to fight off drowsiness, clinking the spoon against the porcelain.\n\n\nTo combat drowsiness, she stirred sugar into her self-made coffee, the spoon clinking on porcelain.\n\n\nTo shake off drowsiness, she makes coffee, stirring sugar with a clinking spoon.\n",
    "0_7": "The kiosk, or New Pavihon as it is sometimes called, was built by a French architect in the middle of the nineteenth century.\n\n\n[2] The mosque was founded in the early sixteenth century by Ahi Çelebi ibni Kemal, chief physician at the hospital of Fatih’s külliye.\n\n\n[6] He disconnected the telephone—lest he be bothered by his habitual prank caller —and arranged his cutlery, a plate of leftover meatballs and pilaf, and glass of lemon juice on a nineteenth-century Qajar table tray.\n\n\nThe advent of cybernetics and the progression of information technology in the previous century have led to a growing perception that conventional urban planning methods are becoming increasingly inadequate.\n\n\nLocated in Istanbul, Turkey, this historic Turkish bath was constructed during the 16th century during the reign of Sultan Suleiman the Magnificent.\n\n\nOver the centuries, the Hürrem Sultan Hamamı witnessed the ebb and flow of Turkish history.\n",
    "0_8": "I stroll out with the baby, observing scratched floors and bougainvillea vines.\n\n\nFanis examines the coffee cups for jealousy bubbles, finding none in Kosmas’s, but one persistent bead near the edge of his own glass.\n\n\nThe mosaic of archangel Gabriel remained, while Michael’s feathers vanished.\n\n\nThe mosaic of archangel Gabriel remained, while Michael’s feathers vanished.\n\n\nThe mosaic of archangel Gabriel remained, while Michael’s feathers vanished.\n\n\nI look at the scratched floors in the hallway and at the bougainvillea vines and can’t decide if they are pulling the balcony down or holding it up.\n\n\n[6] When the shredded chicken pudding and coffee arrived, Fanis examined both cups for jealousy bubbles: Kosmas’s had none, whereas his had a persistent bead near the edge of the glass.\n\n\n[8] I look at the scratched floors in the hallway and at the bougainvillea vines and can’t decide if they are pulling the balcony down or holding it up.\n\n\n[4] When the shredded chicken pudding and coffee arrived, Fanis examined both cups for jealousy bubbles: Kosmas’s had none, whereas his had a persistent bead near the edge of the glass.\n\n\n[7] I look at the scratched floors in the hallway and at the bougainvillea vines and can’t decide if they are pulling the balcony down or holding it up.\n\n\ncoffee kiosk with a cup of strong coffee, breakfast near National Theater looking at the poster for the evening’s performance at luxurious Çıragan Palace Hotel Kempinski, bougainvillea vines, balcony.\n\n\nExamining scratched floors and bougainvillea vines, it’s uncertain if they uphold or weigh down the balcony.\n\n\nI gaze at scratched hallway floors and bougainvillea vines, undecided whether they pull the balcony down or hold it up.\n\n\nBillboard_00 : Scratched floors, bougainvillea vines: pull or uphold the balcony? Water sources: şadırvan in mosque courtyard, sebil at mosque’s corner, çeşme, a simple carved marble slab.\n\n\nLooking at scratched hallway floors and bougainvillea vines, I can’t decide if they pull down or hold up the balcony.\n\n\nBalcony_00 : As I observe the scratched floors in the hallway and the trailing bougainvillaea vines, I’m unsure if they’re dragging the balcony downward or holding it aloft.This project is rooted in a profound grasp of architectural and urban design history.\n",
    "0_9": "[3] After the others had gone, Fanis helped carry the tea and coffee things into the kitchen.\n\n\n[8] Çorlulu Ali Paşa Medresesi Enjoy a cup of coffee or opt for a light meal in the courtyard of this atmospheric, Sinan-designed café, located near Haghia Sophia.\n\n\n[6] The final triumph of the iconodules was celebrated in Haghia Sophia on Easter Sunday 867, when Photius unveiled a huge mosaic in the apse of the church depicting the Virgin and Child.\n\n\n[4] The final triumph of the iconodules was celebrated in Haghia Sophia on Easter Sunday, when Photius unveiled a huge mosaic in the apse of the church depicting the Virgin and Child.\n\n\n[3] Sweet Nymph and Old Hag After the others had gone, Fanis helped carry the tea and coffee things into the kitchen.\n\n\nHaghia Sophia’s iconodule triumph, mosaic of Virgin and Child unveiled.\n\n\nHaghia Sophia’s iconodule triumph, mosaic of Virgin and Child unveiled.\n\n\nAfter the others had gone, Fanis helped carry the tea and coffee things into the kitchen.\n",
    "0_10": "At  the same  level  is  also  a  little  garden,  held  up  by  a  massive retaining  wall,  and  a  balcony  with  a  rail  of  perforated marble  once  gave  a  magnificent  view  over  the  harbour.\n\n\nA species of balcony, near this relic, commands an uninterrupted view of a face of Christ in the act of benediction, in mosaic work, on the ceiling of the half-dome, over the place where the altar formerly stood.\n\n\nAt  the same  level  is  also  a  little  garden,  held  up  by  a  massive retaining  wall,  and  a  balcony  with  a  rail  of  perforated marble  once  gave  a  magnificent  view  over  the  harbour.\n\n\nA species of balcony, near this relic, commands an uninterrupted view of a face of Christ in the act of benediction, in mosaic work, on the ceiling of the half-dome, over the place where the altar formerly stood.\n\n\nThe corner store became a modern apartment building with sea-facing balconies.\n\n\nHouse near Bosphorus with a steep cobblestone alley to the sea.\n\n\nHouse near Bosphorus with a steep cobblestone alley to the sea.\n\n\n[6] The small grocery store at the corner is gone, replaced by a modern two-story apartment building with balconies turned toward the sea.\n\n\n[5] On the west face of the same pier we find one of the most elaborate of the many graffiti which are carved on the walls of Haghia Sophia; it shows a medieval galleon under full sail.\n\n\n[2] Before he launched into the third section of The Mystery of the Letters and the Loss of Mystery, Galip went to make himself a cup of strong coffee.\n\n\nGalip prepared a strong cup of coffee before delving into the third section of “The Mystery of the Letters and the Loss of Mystery.\n\n\nBefore diving into the third section of his work, Galip made himself a strong cup of coffee.\n\n\nSmall grocery store replaced by a two-story apartment building with sea-facing balconies.\n\n\nGalip prepares strong coffee before launching into “The Mystery of the Letters and the Loss of Mystery.\n",
    "0_11": "The metro, tram, and shuttle bus operate from 6 am to midnight.\n\n\nThe metro, tram, and shuttle bus operate from 6 am to midnight.\n\n\n[4] Different sections can be reached by metro, tram, train or bus; but to see their whole length you will need to take a taxi or dolmuş along the main road that runs outside them.\n\n\n[7] “Addicts Alley” is so called because the cafés here once sold opium and hashish as well as coffee and tea.\n\n\nSoldiers and families embraced the trend of sharbat in Kars’ central “Addicts Alley.\n\n\nThe memory remains with the seeing of heritage trams, the ancient mosque, the sound of the broadcasting call for prayer, the smell of the sandalwood, the taste of simit bread, and the tactile sensation of walking on the stone-paved roads.\n\n\nOn Istanbul alley, people are chatting and laughing while they are having tea, the tram driver frequently rings the bell, a cat rushes towards a bird, and the car plays pop music loudly and is slowly driving through the crowded traffic.\n\n\nWhen walking down the alley, the perception of hearing is often acquired subconsciously.\n\n\nIf people walk on the same alley repeatedly, their impression of the sound of that alley will continue to be superimposed in their subconscious mind.\n\n\nThis two-lane wide alley is shared by pedestrians, cats, dogs, cars, and trams.\n\n\nThis is the data that the brain actually stores in memory when one person walks through an alley in Istanbul.\n",
    "0_12": "[1] Mosaic glass tiles in ochre and jade green are embedded into an arched doorway from which one of Bekir’s engraved lanterns hangs.\n\n\n[3] way, boarding the next A schedule of sailing ferry that comes along times is on view at each İDO logo with the same ticket; but pier and a copy of the if you make a second stop you timetable (tarife) can usually will need to buy a new ticket to be bought at the ticket booth.\n\n\n[5] Mosaic glass tiles in ochre and jade green are embedded into an arched doorway from which one of Bekir’s engraved lanterns hangs.\n\n\n[7] Way, boarding the next A schedule of sailing ferry that comes along times is on view at each İDO logo with the same ticket; but if you make a second stop you timetable can usually will need to buy a new ticket to be bought at the ticket booth.\n\n\n[1] Way, boarding the next A schedule of sailing ferry that comes along times is on view at each İDO logo with the same ticket; if you make a second stop you timetable can usually will need to buy a new ticket to be bought at the ticket booth.\n\n\n[1] Street markets are abundant in Istanbul and buying from them reduces the amount of packaging – try the Wednesday market (Çarşamba Pazarı) in Fatih.\n\n\nTable_184 : Spices and herbs are still sold there today, but the bazaar now deals in a wide variety of commodities, which makes it perhaps the most popular market in the city.\n\n\nOn Wednesdays there is a colourful market in the surrounding streets.\n\n\nTo embrace eco-consciousness, consider exploring the lively street markets of Istanbul, such as Çarşamba Pazarı in Fatih, where packaging waste is minimized.\n\n\nMosaic glass tiles adorned an arched doorway with an engraved lantern.\n\n\nThe market featured stalls with tools, spices, coffee grinders, watermelons, and more.\n\n\nIn \"From Russia with Love\", the bustling and narrow market streets generate a tense ambiance, showcasing the exquisite skills of the secret agent.\n",
    "0_13": "“I paint objects as I think them, not as I see them”-Pablo Picasso.\n\n\nYet the arched and ivied windows high above, and the long line of jutting marble columns, once supporting an airy balcony, indicate that it was the abode of pleasure as well as of fear.\n\n\nYet the arched and ivied windows high above, and the long line of jutting marble columns, once supporting an airy balcony, indicate that it was the abode of pleasure as well as of fear.\n\n\n[1] Alternatively, take the E10 bus to Kadıköy and the ferry across the Bosphorus to Eminönü (for Sultanahmet).\n\n\n[5] Dragging himself out of the bed, he lurched into the courtyard and splashed water on his face from the fountain.\n\n\nDragging himself out of the bed, he lurched into the courtyard and splashed water on his face from the fountain.\n\n\nsplashing water on his face from a fountain, crystal glasses shuddering along with porcelain, assorted ornamental pieces, a little white hut behind graffiti, a flat on a garden floor, a well-trodden street.\n\n\nHe drags from bed, splashes water, crystal glasses shudder, porcelain, silver items, ornamental pieces tremble.\n\n\nDragging himself out of the bed, he lurched into the courtyard and splashed water on his face from the fountain.\n\n\nHe drags from bed, splashes water, crystal glasses shudder, porcelain, silver items, ornamental pieces tremble.\n\n\nAlternatively, take the E10 bus to Kadıköy and ferry across the Bosphorus to Eminönü.\n\n\n\" As you will see, we are calling them ‘wicked’ not because these properties are themselves ethically deplorable.\n\n\nWe see this description as a alternative version of \"Istanbul city\", which at this moment can see as both personal and collective.\n",
    "0_14": "For instance, when facing the kiosk from the marble terrace we see that the arcade to the right, or garden side.\n\n\nA ferry and a funicular connected Taksim Square and Kabatas.\n\n\nA ferry and a funicular connected Taksim Square and Kabatas.\n\n\nA ferry and a funicular connected Taksim Square and Kabatas.\n\n\n[6] All buses and ferry boats were packed at this time of the day.\n\n\n[4] Through the window I could see a string of bicycle and car repair shops.\n\n\n[7] Sabotage hated cars, all buses and ferry boats were packed at this time of the day – he was painfully dependent on them.\n\n\n[1] A useful modern funicular links Taksim Square with the ferry terminal at Kabataş from 6am to midnight.\n\n\n[2] Through the window I could see a string of bicycle and car repair shops.\n\n\nI could have paid for a clapquack to look after the girls in the cathouse.\n\n\n[3] Sabotage hated cars, but since he was claustrophobic and couldn’t stand being jammed inside a packed bus or ferry boat – and all buses and ferry boats were packed at this time of the day – he was painfully dependent on them.\n\n\n[3] I could have paid for a clapquack to look after the girls in the cathouse.\n\n\n[2] A useful modern funicular links Taksim Square with the ferry terminal at Kabataş from 6am to midnight.\n\n\n[2] I could have paid for a clapquack to look after the girls in the cathouse.\n\n\nI could have paid for a clapquack to look after the girls in the cathouse.\n",
    "0_15": "garbage, a palatial türbe, medieval Venetian basements, clattering bins on a street, a huge mosaic of the Virgin and Child, the white marble türbe, city’s history, photograph.\n",
    "0_16": "While an orangery was planted on the lower level behind the kiosk of Mustafa Pasha, extending northward as far as the rectangular sunken marble pool.\n\n\nGavriela, displeased with the overflowing ashtray on the table, scuffled toward her armchair.\n\n\nGavriela, displeased with the overflowing ashtray on the table, scuffled toward her armchair.\n\n\nBetween the reservoir tank and the wall of the türbe garden a gate in the east wall of the precinct leads out into a side street, Dede Efendi Caddesi.\n\n\nBetween the reservoir tank and the wall of the türbe garden a gate in the east wall of the precinct leads out into a side street, Dede Efendi Caddesi.\n\n\nOn a night midway across the Atlantic, the ship’s captain invited her to sit at his table for dinner.\n\n\nNear the teal-green pools, we purchase bags of fish food at a kiosk.\n\n\nON A SUNNY Thursday at the beginning of June-nine days before the engagement party-my father and I had a long lunch together at Abdullah Efendi’s restaurant in Emirgân, and I knew even then that I would never forget it.\n\n\nNear the teal-green pools, we purchase bags of fish food at a kiosk.\n\n\n[2] ON A SUNNY Thursday at the beginning of June-nine days before the engagement party-my father and I had a long lunch together at Abdullah Efendi’s restaurant in Emirgân, and I knew even then that I would never forget it.\n\n\n[8] On a night midway across the Atlantic, the ship’s captain invited her to sit at his table for dinner.\n\n\nNear the teal-green pools, we purchase bags of fish food at a kiosk.\n\n\n[2] ON A SUNNY Thursday at the beginning of June-nine days before the engagement party-my father and I had a long lunch together at Abdullah Efendi’s restaurant in Emirgân, and I knew even then that I would never forget it.\n\n\n[8] On a night midway across the Atlantic, the ship’s captain invited her to sit at his table for dinner.\n\n\n[8] Near the teal-green pools, we purchase bags of fish food at a kiosk.\n\n\nbrown awning, mosaic glass tiles, ochre and jade green, teal-green pools.\n\n\n[3] But the seraskier evidently preferred the indignity of sitting on the divan in his trousers to the unpleasant exposure of the central table.\n\n\n[5] But the seraskier evidently preferred the indignity of sitting on the divan in his trousers to the unpleasant exposure of the central table.\n\n\na wooden crate placed on a cart, sitting down at a table, huge refuse bins being dumped, a person preferring to sit on a divan.\n\n\n[6] But the seraskier evidently preferred the indignity of sitting on the divan in his trousers to the unpleasant exposure of the central table.\n\n\nhuge refuse bins, tea glasses, kiosks for serving drinks, a seraskier sitting on a divan with trousers.\n\n\n[7] The white marble türbe of Pertevniyal stands behind her mosque.\n\n\n[3] The white marble türbe of Pertevniyal stands behind her mosque.\n\n\nCoffee_97 : Near the teal-green pools, we purchase bags of fish food at a kiosk.\n\n\nThe seraskier chooses sitting on the divan in trousers over the exposed central table.\n\n\nCart_03 : Preferring the divan’s modesty, the seraskier entered the stationery store.\n\n\nMeanwhile, near the teal-green pools, bags of fish food are conveniently purchased at a kiosk.\n",
    "0_17": "The kiosk, adorned by teal-green pools and echoing with the memory of galleys’ salute, stands as a historical jewel in the vibrant tapestry of Istanbul.\n\n\nThe kiosk, adorned by teal-green pools and echoing with the memory of galleys’ salute, stands as a historical jewel in the vibrant tapestry of Istanbul.\n",
    "0_18": "One day I stood on the balcony overlooking the Bosphorus, watching the tackmg of a ship that had caught the evening sun in its white sails Closer and closer it came, until I recognised the pale, sphinx-like face m the stern.\n\n\nOne day I stood on the balcony overlooking the Bosphorus, watching the tackmg of a ship that had caught the evening sun in its white sails Closer and closer it came, until I recognised the pale, sphinx-like face m the stern.\n\n\nDisconnecting the phone, he arranges his meal on a Qajar table tray.\n\n\nGrisly photos adorned the table: car wrecks, deaths, and a snapped cable disaster.\n\n\n[4] According to information from the research team working on Büyük Valide Han (Burak Sevingen and Zerrin úren), the little white hut behind the graffiti houses a textile dyeing workshop.\n\n\n[24] According to information from the research team working on Büyük Valide Han, the little white hut behind the graffiti houses a textile dyeing workshop.\n\n\n[4] According to information from the research team working on Büyük Valide Han (Burak Sevingen and Zerrin úren), the little white hut behind the graffiti houses a textile dyeing workshop.\n\n\nAccording to information from the research team working on Büyük Valide Han, the little white hut behind the graffiti houses a textile dyeing workshop.\n\n\nIn the bustling ambiance, a waiter delicately arranged their chosen items from the tray onto the awaiting table.\n\n\nThe waiter placed their choices from the tray onto the table.\n\n\nTable_18 : The waiter placed their choices from the tray onto the table.\n\n\nEnsuring security, he disconnected the telephone and set up his meal and utensils on a Qajar table tray.\n\n\nThis choice allows us to access a rich assortment of matching outcomes.\n\n\nIstanbul has a rich skyline with a variety of rooftops.\n",
    "0_19": "Ka found a seat by the window at a nearby table.\n\n\nKa found a seat by the window at a nearby table.\n\n\nbustling bar and café scene set in a vibrant summer night, a person standing at a counter fully stocked with foreign liquor, a corner with a handsome sebil, graffiti, textile dyeing workshop.\n\n\nIt envisions the city as a vibrant and ever-evolving entity engaged in an enduring conflict between two contrasting perspectives: the top-down and the bottom-up.\n\n\nWe commence by establishing three fundamental elements essential for crafting a vibrant urban scenario:.\n\n\nHowever, the urban transformation prompted by shifting economic, social, and political landscapes has led to the erosion of this rich cultural tapestry.\n\n\nAmidst this metamorphosis of the urban landscape, driven by shifting economic, social, and political dynamics, numerous inhabitants of historic districts such as Balat Street, Istiklal Street, and Tarlabasi Boulevard, drifted away from the once vibrant and multifaceted communities that thrived there.\n",
    "0_20": "Do you think an owl might ever perch on the balcony.\n\n\n[6] At the corner to the left is the handsome sebil with five grilled openings; behind it is the really palatial türbe of the founder, looking rather like a small mosque.\n\n\n[6] At the corner to the left is the handsome sebil with five grilled openings; behind it is the really palatial türbe of the founder, looking rather like a small mosque.\n\n\n[1] At the corner to the left is the handsome sebil with five grilled openings; behind it is the really palatial türbe of the founder, looking rather like a small mosque.\n\n\n[6] Do you think an owl might ever perch on the balcony.\n\n\nBalcony_02 : Do you think an owl might ever perch on the balcony.\n\n\nAt the corner to the left is the handsome sebil with five grilled openings.\n\n\nNotably, our project not only provides a platform for transforming abstract sentiments into tangible design elements but also offers a dynamic arena for exploring the ever-shifting conflicts within cities.\n\n\nWe also intend to apply 55 (or more!!!) urban concepts to these personas, illustrating a concept of continual shifting between opposing viewpoints.\n\n\nThe BMU is the neuron in the SOM whose weight vector is closest to a given input vector in Euclidean distance.\n\n\nthe BMU represents the neuron in the SOM that is most similar to the input vector in terms of its weights.\n\n\nDuring training, the SOM adjusts its weights to move the BMU closer to the input vector, while also adjusting the weights of neighboring neurons to a lesser extent.\n\n\nWhen we present a text data to the SOM after it has been trained, the BMU for that data is the neuron whose weights most closely match the input vector.\n\n\nIn spite of that, with the advent of cinema, a shift began to occur.\n\n\nThey could also serve as a clue, revealing shifts in the story's evolution.\n",
    "0_21": "In an old picture each of these three rooms had a separate balcony, and today there is only one long balcony.\n\n\nPrompt : In an old picture each of these three rooms had a separate balcony, and today there is only one long balcony.\n\n\nIn an old picture each of these three rooms had a separate balcony, and today there is only one long balcony.\n\n\nThe Salon of Murat III, built by Sinan, has fine tiled walls, a handsome fountain and a large hearth.\n\n\nThe Salon of Murat III, built by Sinan, has fine tiled walls, a handsome fountain and a large hearth.\n\n\nThe Salon of Murat III, built by Sinan, has fine tiled walls, a handsome fountain and a large hearth.\n\n\n[5] The Salon of Murat III, built by Sinan, has fine tiled walls, a handsome fountain and a large hearth.\n\n\n[5] The Salon of Murat III, built by Sinan, has fine tiled walls, a handsome fountain and a large hearth.\n\n\nThe Salon of Murat III, built by Sinan, has fine tiled walls, a handsome fountain and a large hearth.\n\n\nIn the film scenes, cameras with fast movements focus on characters  with speedy activity , and the surrounding areas are blurred.\n\n\nFraming, camera movement, and editing are fundamental elements in film production.\n\n\nCamera movement refers to changes in the camera's position, angle, or focal length during filming.\n\n\nThrough the movement of the camera, the audience can have a more comprehensive understanding of the characters and objects in the film.\n\n\nCamera depth of field: The focus of cameras differ in highlighting different parts of the film scenes.\n\n\nThe camera path is made up of the relative positions of the frames in the movie.\n\n\nWhen walk along the camera path, the focus of lens (eyes) is the same as it is in the film.\n\n\nThe relative positions between fragments and their viewing points (cameras) are fixed.\n\n\nIn terms of this, to control the positions of cameras is to control the organizations of the fragments.\n",
    "0_22": "Key Rooms open to the public Areas closed to the public Exit Entrance The Salon of Murat III, built by Sinan, has fine tiled walls, a handsome fountain and a large hearth.\n\n\nKey Rooms open to the public Areas closed to the public Exit Entrance The Salon of Murat III, built by Sinan, has fine tiled walls, a handsome fountain and a large hearth.\n\n\n[4] He glanced over at the library table where Saffet was sitting.\n\n\n[4] He glanced over at the library table where Saffet was sitting.\n\n\n[5] Key Rooms open to the public Areas closed to the public Exit Entrance KEY 1 The Salon of Murat III, built by Sinan , has fine tiled walls, a handsome fountain and a large hearth.\n\n\nHis gaze shifted to Saffet sitting at the library table.\n\n\nTable_116 : He glanced at Saffet at the library table.\n",
    "0_23": "As he savored his coffee, he observed the bustling atmosphere around him, with artisans selling their wares and people going about their day.\n\n\nAs he savored his coffee, he observed the bustling atmosphere around him, with artisans selling their wares and people going about their day.\n\n\n[6] That same day, I put the baby in her pram and walked out of the house into the bustling street.\n\n\nfine tiled walls, a bustling cafe scene in the summer, art nouveau kiosk captured in the midst of a thriving city atmospherea crystal candy bowl on a coffee table, a folding table set for breakfast.\n\n\nA fortune-teller taught the ancient art of tasseography amid Mount Sannine’s shadow and hospital visits.\n\n\nThat same day, I put the baby in her pram and walked out of the house into the bustling street.\n",
    "0_24": "She shared white chocolate from a crystal candy bowl on the table.\n\n\nShe shared white chocolate from a crystal candy bowl on the table.\n\n\nShe shared white chocolate from a crystal candy bowl on the table.\n\n\n[2] She then offered white chocolate from the crystal candy bowl on the coffee table.\n\n\n[2] It was here, that a master fortune-teller, taking a liking to her, taught her the ancient art of tasseography – divination based on reading tea leaves, wine dregs, coffee grounds.\n\n\n[3] It was here, in the shadow of Mount Sannine, in between successive hospital visits, that a master fortune-teller, taking a liking to her, taught her the ancient art of tasseography – divination based on reading tea leaves, wine dregs, coffee grounds.\n\n\n[2] It was here, that a master fortune-teller, taking a liking to her, taught her the ancient art of tasseography – divination based on reading tea leaves, wine dregs, coffee grounds.\n\n\n[3] She then offered white chocolate from the crystal candy bowl on the coffee table.\n\n\na crystal candy bowl on a coffee table, a folding table set for breakfast, large and pleasant courtyard with a picturesque graveyard, a cafe or restaurant on the lower level of the bridge.\n\n\n” A master fortune-teller taught her the ancient art of tasseography – divining from tea leaves, wine dregs, and coffee grounds.\n\n\nIn a gracious gesture, she offered white chocolate from a crystal candy bowl resting on the coffee table.\n\n\nTable_231 : Afterward, she presented white chocolate from the crystal candy bowl resting on the coffee table.\n\n\n” Master fortune-teller teaches tasseography—reading tea leaves, wine dregs, and coffee grounds.\n",
    "0_25": "Ka sat down at a table next to the window.\n\n\nSimone de Beauvoir sits in a high chair at one end of the table.\n\n\nSimone de Beauvoir sits in a high chair at one end of the table.\n\n\n[1] Simone de Beauvoir sits in a high chair at one end of the table.\n\n\n[3] Daphne slumped in her chair and folded her arms over her chest.\n\n\n[4] Galip sat down on the chair next to the door and the woman sat down on the stool next to her dressing table, a close relative of the one in the film.\n\n\n[3] I sat down at my table and took out my calculator.\n\n\nGalip sat down on the chair next to the door and the woman sat down on the stool next to her dressing table, a close relative of the one in the film.\n\n\n[1] Daphne slumped in her chair and folded her arms over her chest.\n\n\n[2] I sat down at my table and took out my calculator.\n\n\nI sat down at my table and took out my calculator.\n\n\nAlthough it’s impossible to sit on the chairs, we remove them from the table so Joy can set down her backpack.\n\n\nGalip and the woman took their seats, chairs and stools, respectively.\n\n\nChair_09 : Galip took a seat by the door, while the woman settled on a stool by her dressing table, reminiscent of one in a film.\n",
    "0_26": "They had a fine house on the Bosphorus, with a large balcony, almost covered by Virginian creeper, and here, going by in the steamer, I had often caught a glimpse of their heads as they sat on the balcony at work or afternoon tea.\n\n\nThey had a fine house on the Bosphorus, with a large balcony, almost covered by Virginian creeper, and here, going by in the steamer, I had often caught a glimpse of their heads as they sat on the balcony at work or afternoon tea.\n\n\nAs the steam train arrived at Erzurum station, I challenged and defeated him in our quiz game.\n\n\nAs the steam train arrived at Erzurum station, I challenged and defeated him in our quiz game.\n\n\n[4] He lay experimentally upon the stone bench inside each tomb, searching among those resting places for the couch that would be most comfortable.\n\n\nmysterious stone bench, elegant, extraordinary, introspective, somber, exploring comfortable resting places.\n\n\n[5] He lay experimentally upon the stone bench inside each tomb, searching among those resting places for the couch that would be most comfortable.\n\n\nCuriously, he experimented by lying on stone benches inside each tomb, seeking the most comfortable couch.\n\n\nBench_01 : He experimented with the stone benches in each tomb, seeking the most comfortable one.\n\n\nThe discourse surrounding smart cities often depicts urbanization as a crisis.\n\n\nDocumentaries often showcase historical landmarks, making marble a suitable material to evoke an elegant atmosphere.\n\n\nArthouse films often include black-and-white scenes, and their quiet ambiance and color scheme are better matched with concrete materials.\n",
    "0_27": "The ice on the windows gave an orange glow to the light from the streetlamps and the surrounding houses.\n\n\nHe made his way along the train track, past the snow-covered silo that loomed overhead like a great white cloud, and was soon back inside the station.\n\n\nThe ice on the windows gave an orange glow to the light from the streetlamps and the surrounding houses.\n\n\nHe made his way along the train track, past the snow-covered silo that loomed overhead like a great white cloud, and was soon back inside the station.\n\n\nThe mosque was formerly surrounded by the usual buildings of the külliye: an imaret, a medrese and a mektep.\n\n\n[6] After setting the plate and a jar of honey on the table and urging us to sit and eat, she makes tea, pours it into three tulip-shaped glasses, and sends her husband down the steps toward the road, his dog trailing behind him.\n\n\na low table, a sunny morning, tea leaves, wine dregs, and coffee grounds,  plate of honey and tea on a table, tulip-shaped glasses of tea, families enjoying a fad.\n\n\nOffering tea in tulip-shaped glasses, the wife sent her husband with a dog down the steps.\n",
    "0_28": "[1] So at the center of the külliye he placed his mosque and tomb, known today as Fatih Camii.\n\n\nMeanwhile Selim had hardly stirred from the Harem, most of his excursions having been to Edirne to inspect the mosque complex that he was building there.\n\n\nThe Koca Sinan Pasa tomb complex features a tea garden.\n\n\nBazaar Quarter, across Bıleycıler Sokak, houses Koca Sinan Pasa tomb complex with a tea garden courtyard.\n\n\nFanis ordered tea and cookies, settled at a wooden table under an awning with the shop’s name.\n\n\nFanis ordered tea and cookies, settled at a wooden table under an awning with the shop’s name.\n\n\nInside, dim light shimmers through the steam, from small glass windows in the hararet’s dome.\n\n\nInside, dim light shimmers through the steam, from small glass windows in the hararet’s dome.\n\n\nMeanwhile Selim had hardly stirred from the Harem, most of his excursions having been to Edirne to inspect the mosque complex that he was building there.\n\n\n[7] Meanwhile Selim had hardly stirred from the Harem, most of his excursions having been to Edirne to inspect the mosque complex that he was building there.\n\n\n[7] Meanwhile Selim had hardly stirred from the Harem, most of his excursions having been to Edirne to inspect the mosque complex that he was building there.\n\n\n[7] Situated across Bıleycıler Sokak, an alleyway off Çorlulu Ali Paşa Courtyard, is the Koca Sinan Paşa tomb complex, the courtyard of which is another tea garden.\n\n\n[3] As for the young Kurds who’d attended the meeting at the Hotel Asia, they’d all abandoned the city, though at the Sundayevening cockfight I saw Zahide’s grandson the gambler, who greeted me warmly and shared some of his raki, which we sipped surreptitiously out of tea glasses.\n\n\n[2] On the left side of the square is the entrance to the mosque complex of Koca Mustafa Paşa, after whom the avenue and the surrounding neighbourhood are named.\n\n\n[3] As for the young Kurds who’d attended the meeting at the Hotel Asia, they’d all abandoned the city, though at the Sundayevening cockfight I saw Zahide’s grandson the gambler, who greeted me warmly and shared some of his raki, which we sipped surreptitiously out of tea glasses.\n\n\nFüsun left the window, gliding to the table to sit across from me.\n\n\nSelim, devoted to Edirne’s mosque complex, rarely left the Harem.\n\n\nKoca Sinan Paşa tomb complex, across an alley from Çorlulu Ali Paşa Courtyard, features a tea garden.\n",
    "0_29": "If we follow this street past the intersection and two blocks farther along, we will come on our left to an ancient mosque at the corner of Kadı Çeşme and Şebnem Sokaks.\n\n\n[6] A three-tiered ablutions fountain stands beneath the central dome of this monumental mosque, which was erected in 1396.\n\n\n[7] Eyüp Mosque The holiest mosque in Istanbul stands beside the tomb of Eyüp Ensari, a companion of the Prophet Mohammed.\n\n\n[5] They are of three kinds: the şadırvan is a large fountain in the middle of a mosque courtyard used for ritual ablutions; the sebil, often at the corner of the outer wall of a mosque precinct, is a monumental domed building with three or more grilled openings in the façade; the çeşme is also sometimes monumental, often in the middle of a public square, but more frequently it is a simple carved marble slab with a spigot in the centre and a basin below.\n\n\n[2] The mosque interior is essentially a square room covered by a large dome resting on four circular arches in the walls.\n\n\n[4] A three-tiered ablutions fountain stands beneath the central dome of this monumental mosque.\n\n\n[5] Eyüp Mosque The holiest mosque in Istanbul stands beside the tomb of Eyüp Ensari.\n\n\n[1] On the other side of the mosque complex is the Nuruosmaniye Gate.\n\n\n[4] If we follow this street past the intersection and two blocks farther along, we will come on our left to an ancient mosque at the corner of Kadı Çeşme and Şebnem Sokaks.\n\n\nEntrance to Koca Mustafa Paşa mosque complex on square’s left.\n\n\nEntrance to Koca Mustafa Paşa mosque complex on square’s left.\n\n\nTwo blocks ahead, an ancient mosque at Kadı Çeşme and Şebnem Sokaks’ crossroads.\n\n\nThe marble panel of calligraphy decorates the mosque’s interior beautifully, along with the pair of sebils outside.\n\n\nThe Great Mosque’s central dome housed a three-tiered ablutions fountain.\n\n\nThe Great Mosque features a three-tiered ablutions fountain under its dome.\n\n\nFor instance, the indoor space of mosque is rebuilt with fragments of domes, walls and plaques.\n",
    "0_30": "Passing the mosque courtyard, a gray striped cat picks at a chicken bone in an alley.\n\n\nIn the delightful garden courtyard of the mosque, two huge plane trees stand tall on a platform.\n\n\nUnder the shade of a great linden tree and an awning adorned with whimsical brown letters spelling “Neighbor’s House,” Fanis found a peaceful spot at a small wooden table.\n\n\nIn the delightful garden courtyard of the mosque, two huge plane trees stand tall on a platform.\n\n\nUnder the shade of a great linden tree and an awning adorned with whimsical brown letters spelling “Neighbor’s House,” Fanis found a peaceful spot at a small wooden table.\n\n\nHaving placed his order, Fanis collected his tray of tea and cookies, stepped onto the patio that stretched between the north wall of the bakery and an abandoned Ottoman cemetery, and settled down at a small wooden table shaded by a great linden tree and an awning with the shop’s name, printed in whimsical brown letters.\n\n\nHaving placed his order, Fanis collected his tray of tea and cookies, stepped onto the patio that stretched between the north wall of the bakery and an abandoned Ottoman cemetery, and settled down at a small wooden table shaded by a great linden tree and an awning with the shop’s name, printed in whimsical brown letters.\n\n\nFanis collected his tray of tea and cookies, stepped onto the patio that stretched between the north wall of the bakery, and settled down at a small wooden table shaded by a great linden tree and an awning with the shop’s name— Neighbor’s House—printed in whimsical brown letters.\n\n\nawning on a north wall with shops name printed in whimsical brown letters, wall lights, geometrically inlaid.\n\n\n[1] Fanis collected his tray of tea and cookies, stepped onto the patio that stretched between the north wall of the bakery and an abandoned Ottoman cemetery, and settled down at a small wooden table shaded by a great linden tree and an awning with the shop’s name— Neighbor’s House—printed in whimsical brown letters.\n\n\n[5] Up we go through the quiet streets, past a group of men leaving the courtyard of the mosque and a gray striped cat that scurries into an alley to pick at a chicken bone.\n\n\n[5] The marble panel of calligraphy around the interior of the mosque is particularly fine, as is the pair of sebils (kiosks for serving drinks) outside.\n\n\nFine marble calligraphy and sebils adorn the mosque’s interior and exterior.\n\n\nFanis placed his order and settled on the bakery’s patio, shaded by a linden tree and an awning.\n\n\nAwning_00 : Under the linden tree’s shade and an awning labeled “Neighbor’s House,” he switched on wall lights, knelt on a cushion, and looked out.\n\n\nUp we go through the quiet streets, past a group of men leaving the courtyard of the mosque and a gray striped cat that scurries into an alley to pick at a chicken bone.\n",
    "0_31": "",
    "0_32": "Tractor tires and exhaust pipes mark the access road from Athens-to-Sparta highway.\n\n\nSeats shared, cat food and kitten houses seen on the road.\n\n\nSeats shared, cat food and kitten houses seen on the road.\n\n\nYashim sifted through the salad leaves while George the Greek emerged from his stall.\n\n\nYashim sifted through the salad leaves while George the Greek emerged from his stall.\n\n\nJust as dogs approach those most scared of them or as the hair falls in the soup of the one person at a dining table who will be most disgusted by it, so the cockroach Cemal had long lost track of had decided to enter none other than Hygiene Tijen’s field of vision.\n\n\nJust as dogs approach those most scared of them or as the hair falls in the soup of the one person at a dining table who will be most disgusted by it, so the cockroach Cemal had long lost track of had decided to enter none other than Hygiene Tijen’s field of vision.\n\n\n[3] Sharing seats, you can also see cat food and small houses made for kittens on the road.\n\n\n[8] There are agriculture and carpentry stalls, laden with nails, stalls with generous and redolent bags of spice and saffron, stalls with brass tea sets, coffee grinders, kebab skewers, stalls selling priceless carpets inveigled for a song from the naive peasants of Anatolia, stalls selling hand-sewn silks, waistcoats, hats and socks, and stalls selling seductively beautiful musical instruments, geometrically inlaid, which Turks can play by instinct, but which Westerners find impossible, even in theory.\n\n\n[8] Today one is greeted on the access road just off the Athens-toSparta highway by a display of outsize tractor-tyres and exhaust pipes.\n\n\n[1] I just wanted to make those who dump their garbage here feel uncomfortable.\n\n\n[2] Sharing seats, you can also see cat food and small houses made for kittens on the road.\n\n\n[3] Now, on this cool, sunny December morning, father and son were sipping their coffee at the breakfast table.\n\n\n[4] The couple sat side by side on cushions on the floor, quietly eating breakfast from the low table.\n\n\nThe carpet seller in Cappadocia who, at lunchtime, puts his carpets aside and thinks nothing of offering his customers lamb stew his mother made.\n\n\n[2] Then I turned around and entered the stationery store.\n\n\n[4] Latife Tekin  writes of these gecekondu in her novel Tales from the Garbage Hills: One winter night, on a hill where the huge refuse bins came daily and dumped the city’s waste, eight shelters were set up by lantern light near the garbage heaps.\n\n\n[6] Then I turned around and entered the stationery store.\n\n\n[4] Füsun drew away from the window and taking five steps floated to the table like a feather to sit across from me in silence.\n\n\n[4] Now, on this cool, sunny December morning, father and son were sipping their coffee at the breakfast table.\n\n\nLatife Tekin  writes of these gecekondu in her novel Tales from the Garbage Hills: One winter night, on a hill where the huge refuse bins came daily and dumped the city’s waste, eight shelters were set up by lantern light near the garbage heaps.\n\n\nHe eats his fill and then ends up in his kingdom: the garbage dump.\n\n\nThe couple sat side by side on cushions on the floor, quietly eating breakfast from the low table.\n\n\n[1] Now, on this cool, sunny December morning, father and son were sipping their coffee at the breakfast table.\n\n\n[4] Karma Half an hour later, they all sat around the dining table.\n\n\n[5] Or the carpet seller in Cappadocia who, at lunchtime, puts his carpets aside and thinks nothing of offering his customers lamb stew his mother made.\n\n\n[4] Füsun drew away from the window and taking five steps floated to the table like a feather to sit across from me in silence.\n\n\n[5] Latife Tekin writes of these gecekondu in her novel Tales from the Garbage Hills: One winter night, on a hill where the huge refuse bins came daily and dumped the city’s waste, eight shelters were set up by lantern light near the garbage heaps.\n\n\n[7] I just wanted to make those who dump their garbage here feel uncomfortable.\n\n\nFüsun drew away from the window and taking five steps floated to the table like a feather to sit across from me in silence.\n\n\nDo something so drastic that they’ll never again want to dump garbage here.\n\n\nAmid gardens, fields of sunflowers, little farmhouses, the garbage dump.\n\n\nTable_257 : Füsun drew away from the window and taking five steps floated to the table like a feather to sit across from me in silence.\n\n\nGraceful as a feather, Füsun drew away from the window and glided to the table, wordlessly seating herself across from me.\n\n\nThe morning was cool and sunny as father and son enjoyed their coffee at the breakfast table.\n\n\nOn a cool December morning, father and son enjoyed coffee at the breakfast table.\n\n\nIn the novel “Tales from the Garbage Hills,” Latife Tekin  describes gecekondu shelters set up on a hill near garbage heaps by lantern light.\n\n\nGarbage_02 : Eight shelters emerged near daily garbage heaps on a lantern-lit hill one winter night.\n\n\nSeated side by side on cushions, the couple quietly enjoyed breakfast from a low table.\n\n\nFather and son sipped coffee at the breakfast table on a cool December morning.\n\n\nAround the dining table, they gathered after half an hour.\n\n\nA Cappadocia carpet seller served lunchtime lamb stew, setting carpets aside.\n\n\nTable_05 : Seated together on cushions, the couple quietly breakfasted from a low table.\n\n\nIn Karma, they gathered around the dining table half an hour later.\n\n\nPeople scavenged through garbage, shared seats near cat food and miniature houses.\n",
    "1_0": "[4] A man was talking to Black from the trees in the empty yard on the far side of the street.\n",
    "1_1": "Holding my mother’s hand, I would gaze in fascination at the displays in the shops: through the steamy window of the orist, at the cyclamens that looked like red wolves; in the window of the shoe shop, at the barely visible wires that suspended the high-heeled shoes in midair; and at the laundry where my father sent his shirts to be starched and ironed.\n\n\n[2] The sheikh discreetly taps a dervish on the shoulder.\n",
    "1_2": "By tiling the geometries together directly, a completed scene is built.\n",
    "1_3": "[1] BOAZIÇI KÖPRÜSÜ is the seventh longest suspension bridge in the world.\n\n\ncathouse, seventh longest suspension bridge, world, rectangular dining room table, coconut cake slices, notebook, white lilies, pencil tips.\n\n\nBoasting impressive stature, BOAZIÇI KÖPRÜSÜ claimed its position as the world’s seventh longest suspension bridge.\n\n\nThis city of meaning contains the whole world, presenting an all-embracing simultaneity that opens up an endless world to the researcher.\n\n\nSpy movies show a reflection of mysterious imagination and enhances the stereotype for Istanbul being a mysterious oriental city.\n",
    "1_4": "As a result, Webber and Rittel (1973) posited that urban planning challenges are inherently political.\n\n\nYouTube vlogs are the real experiences in the city and impact viewers by shaping their perception and impression on them.\n\n\nBy looking at the geometry, viewers share the same spatial experience as watching the film.\n",
    "1_5": "",
    "1_6": "",
    "1_7": "[4] It has recently been rebuilt and now houses a restaurant and café.\n",
    "1_8": "[5] Part of the luxurious Çırağan Palace Hotel Kempinski, the Laledan restaurant serves great brunches in a fairy-tale setting.\n\n\n[7] The Laledan restaurant serves great brunches in a fairy-tale setting.\n\n\nbillboard on the outer wall, in a public square, simple carved marble slab, fairy-tale setting, hallway, bougainvillea vines.\n\n\n[6] Part of the luxurious Çırağan Palace Hotel Kempinski, the Laledan restaurant serves great brunches in a fairy-tale setting.\n\n\nThe Laledan restaurant within the luxurious Çırağan Palace Hotel Kempinski offered enchanting brunches.\n\n\nLaledan restaurant at Çırağan Palace Hotel Kempinski serves brunches in a fairy-tale setting.\n",
    "1_9": "balcony with scratched floors, bougainvillea vines, balcony, empty coffee cup, cigarette, poster, evenings performance, luxurious , great brunches, fairy-tale setting, small corner, modern two-story apartment building, balconies, exhaust pipes.\n\n\nAs I lifted the oil lamp from the floor, we both stared meaningfully at the cushion upon which I’d flattened him.\n\n\nUpon the shredded chicken pudding and coffee’s arrival, Fanis inspected their cups for jealousy bubbles.\n",
    "1_10": "",
    "1_11": "All the faces of Istanbul are neither \"real\" nor \"false\", they coexist and make up the complete Istanbul.\n",
    "1_12": "",
    "1_13": "These included optimizing water and energy usage, utilizing sustainable materials, and implementing green infrastructure where feasible.\n",
    "1_14": "",
    "1_15": "",
    "1_16": "",
    "1_17": "",
    "1_18": "",
    "1_19": "Navigate left from the square’s far corner to the first junction.\n\n\nUnlike traditional networks, SOMs have a grid-like structure where neurons adjust their weights during training to cluster similar input data patterns, thus providing a topological, lower-dimensional representation of the data.\n",
    "1_20": "Consider, for instance, a rooftop in Istanbul depicted on the left.\n",
    "1_21": "For instance, a street scene from Istanbul, might be matched with an art video showcasing a dynamic dance performance.\n",
    "1_22": "",
    "1_23": "[5] He went off to the toilet where he’d met with Necip two days earlier and walked into the same stall.\n",
    "1_24": "",
    "1_25": "For example, the latent walk between the cat and the chair is based on their internal representation.\n",
    "1_26": "",
    "1_27": "The square often hosts cultural events, festivals, and activities that bring the community together.\n",
    "1_28": "",
    "1_29": "bench near an oriel window, with a tray of tea and cookies on the patio of a  north wall bakery Sharing seats, with granny’s cinnamon drink, Italian and Turkish influences.\n",
    "1_30": "Embrace the allure of Istanbul’s historic sites, from the Vespa carefully chained under a brown awning, to owning a cafe bar , where you can savor coffee in the courtyard, while discovering the tranquility of a fountain-washed courtyard at Rustem Bey’s residence, and indulging in bags of fish food near the teal-green pools by the charming kiosk, all while admiring the holiness of Mosque and the architectural magnificence of Mosque.\n",
    "1_31": "Awning_02 : Kosmas secured the Vespa to a post supporting the building’s brown awning.\n",
    "1_32": "[4] Kosmas carefully chained the Vespa to one of the posts supporting the building’s brown awning.\n\n\n[8] Kosmas carefully chained the Vespa to one of the posts supporting the building’s brown awning.\n\n\n[2] On one end of the rectangular dining room table there was, as usual, especially prepared for the lesson ahead of time: coconut cake slices lined up on two porcelain plates with white napkins on the side, the notebook with the white lilies spread open, pencil tips carefully sharpened, the ashtray laid ready.\n\n\n[2] Kosmas carefully chained the Vespa to one of the posts supporting the building’s brown awning.\n\n\nContemplating options, the notion of hiring a clapquack to care for the girls in the cathouse was entertained.\n\n\nAs the rectangular dining table was readied for the lesson, meticulously prepared elements awaited – coconut cake slices, porcelain plates, sharp pencils, and a notebook adorned with white lilies.\n\n\nOn one end of the rectangular dining room table, there were coconut cake slices, a notebook with white lilies, pencils, and an ashtray—all prepared for the upcoming lesson.\n",
    "2_0": "Along  the  middle  of  the  street, these  Oriental  fingers  and  arms  carried  no  weightier burden  than  a  parasol  or  an  infant.\n\n\nHolding his  musket  all  on  one  side,  (as  they  always  do),  and when  bored,  tossing  it  about  as  a  school-girl  does  her parasol.\n\n\nThis was all the more distressing to three or four European ladies who were there, because etiquette forbids the opening of a parasol in presence of the Sultan.\n\n\nThe high colour that distinguishes each individual, and the parasol which inevitably accompanies street dress.\n\n\nThree or four ladies who happened to be there because etiquette forbids opening a parasol in the presence of the Sultan.\n\n\nDespite the heat of the sun, these boats have no awning ; for that convenience would not only retard their progress, but be contrary to the Turkish etiquette, which restricts its use to the caiques of the Sultan only; but it is usual to carry a parasol.\n\n\nThe Chinese representation on plates, that I almost expected to see Sing-sing parasol pecping over it.\n\n\nLight up all this with a brilliant sunshine, place here and there in these streets filled with light a few long-veiled senoras who hold their open fan against their cheek by way of a parasol.\n\n\nThesun is implacable and oppressive, despite her parasol, and it is awful tohave to spend so much time sitting upright when her natural propensityis for the horizontal.\n\n\nThe night sky lacked the brilliant lights of flares and rockets, leaving only shadows.\n\n\nThe night sky lacked the brilliant lights of flares and rockets, leaving only shadows.\n\n\n[1] Sometimes one of the big crows that lived in the back garden would perch on the balcony to watch us in silence.\n\n\n[8] Sometimes one of the big crows that lived in the back garden would perch on the balcony to watch us in silence.\n\n\n[2] It was not just that the searing pains of love would disappear the moment I sat down at the same table with Füsun; I would immediately forget that until just now, this same pain had brought me to thoughts of suicide.\n\n\n[2] Once a week, my grandmother would go to Beyoğlu to lunch alone at a famous and expensive restaurant called Aptullah Efendi, and afterward she would complain at great length about everything she’d eaten.\n\n\nA crow from the garden would sometimes perch silently on the balcony.\n\n\nThe pain of love would vanish sitting with Füsun; the pain that brought thoughts of suicide would fade.\n\n\nA big crow from the garden watches us from the balcony in silence.\n\n\nWhen something is forgotten, it is easy to understand that some details would be overlooked.\n",
    "2_1": "",
    "2_2": "Therefore, Altering this dataset would result in a different perception of the world.\n",
    "2_3": "When looking at the cities in the world, it can be noticed that they are quite look alike and discern a certain homogeneity in their evolution over time, with many exhibiting similar patterns and characteristics.\n\n\nHowever, the manual blurring of vision is subjectively conscious, and the results are not quite as expected.\n",
    "2_4": "They have the ability to paint a new picture of a place and enhance one’s experiences.\n\n\nWe settled down for a picnic on a meadow looking out at the view painted in this Antoine Ignace Melling (1763-1831) landscape.\n\n\nSharing stories with each other, the objects exist as a collective symphony and paint vibrant worlds for those who look deeper.\n\n\n[5] This was a picture that showed the forced friendship between the cat and the mouse from Kelile and Dimne.\n\n\n[7] This was a picture that showed the forced friendship between the cat and the mouse from Kelile and Dimne.\n\n\n[3] Ben remembered the winding road up to Berchtesgaden, lined with jeeps, a new tourist attraction, GIs hunting for souvenirs while the executives stood at Hitler’s vast picture window.\n\n\nPicture: forced friendship between cat and mouse from Kelile and Dimne.\n\n\nObelisk, as the landmark in the site, is involved as landscape node and supplement of context.\n",
    "2_5": "Jacobs believed that the solution lies in comprehending and utilizing the inherent order of cities, incorporating the most insightful findings from new sciences and pragmatic methods.\n\n\nMoses subscribed to the modernist urban planning ideology, which viewed cities as diseased and sought to address this through large-scale infrastructural solutions, often resulting in the destruction of city features.\n",
    "2_6": "It is evidenced that Cybernetics, as well as the concept of smart cities, had a significant impact on urban planning approaches and introduced a technologically informed system thinking to address what was perceived as 'wicked' problems of urban complexity.\n\n\nThe discourse on smart cities with the application of cybernetics is anchored in the idea that cities inherently pose challenges that require systematic solutions to mitigate.\n\n\nProponents of this view frame the complexities of urban life as a problem that can be addressed by implementing technology-based solutions.\n\n\nWicked problems are complex, multi-faceted, and difficult to define, solve, or measure.\n\n\nIn the 1960s, Horst Rittel and Melvin Webber(1973) introduced the concept of \"wicked problems\" to challenge the cybernetic approach to urban planning and governance.\n\n\nFurthermore, solutions to these problems have unexpected consequences, making it difficult to test them accurately.\n\n\nVarious challenges that smart cities aim to resolve, such as climate change or mudslides, are considered wicked problems due to their complexity and the challenges they pose to finding solutions.\n\n\nMoses, a proponent of modernist urban planning, believed that the solution to the problems of cities was through the introduction of top-down, infrastructure-led regeneration.\n",
    "2_7": "[6] Then they crossed their legs and sipped their coffee and began to argue about which outsiders to admit and which to exclude.\n\n\nRustem Bey sips coffee, inhaling rich smoke with a new flavor.\n\n\nThe restoration project aimed to breathe new life into the hamam, enabling future generations to experience its magnificence and understand its significance in Turkish history.\n",
    "2_8": "They enrich personal narratives, adding depth and significance to one’s experiences.\n\n\nIt serves as a powerful reminder of the significance of preserving and celebrating our experiences.\n\n\nBillboard_02 : In Cappadocia, a carpet seller serves homemade lamb stew to customers.\n\n\nGiven Istanbul's topography and other influencing factors, the rooftop serves as a fifth façade.\n\n\nThis unique focus led us to recognize the necessity for an intuitive interactive software, tailored to harmoniously integrate the workflows we have devised.\n",
    "2_9": "",
    "2_10": "[2] Placing a cup of coffee on a little table, Selva said, “Why’s that.\n\n\nHe placed the oil lamp just beside the cushion upon which I was seated, in a way that would illuminate my face.\n\n\nThe Hürrem Sultan Hamamı, also known as the Hürrem Sultan Bath, holds a significant place in both history and society.\n\n\nHowever, the essence of these locales has faded into oblivion, with some losing their cultural significance, and others diminishing in importance, these places are then sort of forgotten.\n",
    "2_11": "Likewise, we contemplated the inclusion of review from travellers and locals.\n\n\nAs Turkish society evolved, there emerged a need to reconcile traditional practices with modern values and inclusivity.\n\n\nIt is this complexity that makes lstanbul such a multifaces place to explore.\n",
    "2_12": "[2] Types of Shop antiques shop bakery bank bookshop butcher’s cake shop chemist’s/ pharmacy fishmonger’s greengrocer’s grocery hairdresser’s leather shop market/bazaar newsstand post office shoe shop stationer’s supermarket tailor travel agency.\n\n\nShe’d have to drink that third cup of coffee despite her heartburn, go shopping with the girls even if she preferred to do so alone, go picnicking at Kilyos with her old neighbors even though she really didn’t feel comfortable wearing a swimsuit.\n\n\nkiosk with a third cup of coffee, shopping, girls, alone, picnicking, Kilyos, old neighbors, comfortable, large grilled opening, small wooden, baroque wooden dome.\n\n\nDespite heartburn, she’d drink that third coffee, shop with the girls, join neighbors for a picnic at Kilyos, despite swimsuit discomfort.\n\n\nCoffee_37 : In spite of her heartburn, she would need to finish that third cup of coffee, accompany the girls on shopping trips even if she preferred solitude, and participate in Kilyos picnics with old neighbors.\n\n\nVlogs frequently display luxurious city streets, so more transparent, modern materials have been employed.\n\n\nCurtains in furniture help to make up a completed context.\n",
    "2_13": "[1] Adm charge Küçüksu, with two rivers known to the Ottomans as the “Sweet Waters of Asia”, was a playground for the Imperial court.\n\n\nWith the help of 3d reconstruction software, the frames are reorganized on their original path.\n",
    "2_14": "They are tangible markers, and their presence evokes compelling responses.\n\n\nPaths and furniture provide the viewpoints of observing the Fragment.\n",
    "2_15": "Every place, to some extent, can be remembered partly because it is unique, but partly because it has affected our consciousness and generated enough association to hold in it our personal worlds.\n\n\nAs Fanis sat on the bench of the oriel, he enjoyed a sip of his coffee.\n\n\nAs Fanis sat on the bench of the oriel, he enjoyed a sip of his coffee.\n\n\n[4] After daybreak, as the garbage truck, its bins clattering against its sides, made its way down the street below, Galip went back to take a closer look at Celâl’s photograph in Fatih.\n\n\nWith the consideration of aesthetics, slight adjustments as spinning and rising are operated onto the fragments to provide solid views and comprehensible contexts.\n",
    "2_16": "Exhausted, Kosmas made Nescafé and sat on his oriel window bench.\n\n\nExhausted, Kosmas made Nescafé and sat on his oriel window bench.\n\n\n[5] Kosmas made himself a Nescafé and collapsed onto the padded bench of his oriel window.\n\n\nKosmas made himself a Nescafé and collapsed onto the padded bench of his oriel window.\n\n\nExhausted from carrying boxes, Kosmas collapsed onto his window bench.\n\n\nBench_00 : Exhausted from hauling boxes upstairs, Kosmas collapsed onto his oriel window’s padded bench, sipping Nescafé.\n",
    "2_17": "Every man’s death begins with the death of his father.\n\n\nBetween  this  balcony  and  the  Sultan’s  box  a  richly latticed  window,  covering  a  space  no  larger  than  the cosey  baignoires  common  to  every  French  theatre,  hung like  a  shimmering,  semi-transparent  curtain.\n\n\nBetween  this  balcony  and  the  Sultan’s  box  a  richly latticed  window,  covering  a  space  no  larger  than  the cosey  baignoires  common  to  every  French  theatre,  hung like  a  shimmering,  semi-transparent  curtain.\n\n\n[6] Every time I read about the unpainted, darkened, dilapidated wooden houses, the broken-down fountains, the neglected tombs with their fallen-in roofs, I am amazed that these places I saw while riding around in my father’s car a hundred years.\n\n\nThey first analyzed the grayscale data of each category of sound specifically every 0.\n",
    "2_18": "Objects like fountain, storefront, awning, bench and balcony are detected.\n\n\nThis choice was made not only due to Beşiktaş's central location within Istanbul but also for its unique ability to harmonize both the vivid depiction of a location and the intricate psychological experiences of the author.\n\n\nMuhsin Ertuğrul is the person who first featured Istanbul  in his films and in Turkish cinema with the movie \"Bir Facia-ı Ask\"  (1922).\n",
    "2_19": "[5] Nevertheless, the proportions of the building are so good and the garden in the courtyard so attractive that the general effect is still quite charming.\n\n\n[6] The ablutions are today performed at water taps beneath the graceful arcade which forms part of the north and south walls of the courtyard.\n\n\nEntering, we find ourselves in a large and pleasant courtyard in front of the tekke with a garden on the right side and a picturesque graveyard on the other.\n\n\nWalls are introduced as a part of the installation based on the clusters formed and the position of the objects.\n\n\nA picturesque tekke courtyard held a garden on one side and a charming graveyard on the other.\n\n\nDespite this, the building’s well-proportioned design and attractive courtyard garden maintain a charming ambiance.\n\n\n\"Invisible Cities\" is a novel by Italian writer Italo Calvino, first published in 1972.\n",
    "2_20": "[5] A deceptively named restaurant serving not Spanish cuisine, but Turkish and Kurdish specials, backed by a well-stocked bar.\n\n\nThus, he conceived of a model city, which included everything that conformed to the norm, as well as all possible exceptions.\n\n\nInstead, Polo reveled in the endless narrative, starting with memories, wishes, signs, minuscule details, trade, eyes, names, the dead, sky, stretch, and concealment, constantly sprouting new branches.\n",
    "2_21": "",
    "2_22": "This name corresponds to the typology of buildings within the city, encompassing diverse options such as an art gallery, library, or other architectural entities that serve as contextual anchors.\n\n\nNamed after Hürrem Sultan, the wife of Sultan Suleiman, the hamam served as a testament to the grandeur and opulence of the Ottoman Empire.\n\n\nThe result is such a different vision of the city between science and art.\n\n\nTherefore, a vast collection of art pieces from Istanbul modern art museum is created as the art archive to form the machines’ understanding.\n",
    "2_23": "183) She made an appeal to urban planners and city policymakers to comprehend the complex and interrelated nature of the issues facing cities.\n\n\nHowever, as time passed, the hamam gradually fell into disrepair, requiring restoration and renovation to preserve its cultural heritage and address societal issues.\n\n\nThe renovation of the Hürrem Sultan Hamamı presented an opportunity to address certain societal issues as well.\n\n\nAnother important societal issue addressed during the renovation was environmental sustainability.\n\n\nUltimately, the renovation of the Hürrem Sultan Hamamı not only restored a historic landmark but also provided an opportunity to address societal issues and adapt to the changing needs and expectations of modern society.\n\n\nIn the first attempt, it can be found that the process works, but there are several issues that need to be optimized.\n\n\nThese recordings serve as original source material, contributing to a film library where they can be cross-referenced to find corresponding scenes across various genres.\n",
    "2_24": "[8] He also condemned the immoral performances put on in the theatre.\n\n\nThis intricacy necessitates a heightened level of meticulousness when seeking source materials that authentically capture the essence of Istanbul on a descriptive level.\n\n\nThe space also provides some seating areas for people to rest.",
    "2_25": "Therefore, the initial step in our design process aims to recreate, drawing upon the invisible city as a reference, a dialogue and interaction between two distinct theoretical urban personas, much like Khan and Polo.\n\n\nwith the two personas and the dialogues created, We can then build on this  to further develop our design based on the contradictions and conflicts.\n\n\nDue to Khan's authoritative and governing disposition, we have incorporated 60 prominent top-down theoretical works to embody Khan's persona.\n\n\nThis literary work stands as a cornerstone, encapsulating the spirit of Istanbul's shared memory and experience, allowing it to serve as a poignant foundation for our exploration and dialogue.\n\n\nThese ranged expansively, encompassing not only alternative works by Orhan Pamuk, but also extending to literary offerings such as \"Istanbul Passage\" by Joseph Kanon, the comprehensive \"Istanbul Encyclopedia,\" among others.\n\n\nOur two SOM models have been trained on urban policy datasets— creating the two personas represent Kubla Khan and Macro Polo respectively.\n\n\nSuch inner peace as men gain must represent a tension among contradictions and uncertainties.\n\n\nOur exploration led us to scour platforms like ArchDaily and other architectural resources in pursuit of pertinent works.\n\n\nAmong these three examples, Balat Street is selected for further exploration.\n",
    "2_26": "General Asim Gundu Street in Kadikoy, located on the Asian side of Istanbul is considered as the site of exploration.\n\n\nIn order to showcase the stories and to allow interaction with objects, Uskudar square, located in the center of Uskudar district , on the Anatolian side of Istanbul, is considered a site for installation.\n\n\nCathouse_00 : I considered hiring a clapquack for the cathouse.\n\n\nAll the design steps made are based on the latent state encodings of the surroundings.\n",
    "2_27": "Each cell also contains several other sentences that are closely associated to the BMU.\n\n\nThe cells containing fountain as the keyword are narrowed down and the most connected cell ( lightest colored cell ) is chosen.\n\n\nAll associated sentences within the cell are further processed using PCA.\n\n\nThe key sentences in the cells surrounding the object cell in the SOM are processed to craft the prompt for the segment and visualized through Stable Diffusion.\n\n\n[3] The cells of the medrese surround two sides of the courtyard in which stands a şadırvan in the midst of a pretty garden.\n\n\nThe narrative of the objects is visualised by creating a scene on the wall that combines sentences of cells around the object and the cells that the wall run along.\n\n\nFountain_09 : The medrese cells encircle a courtyard with a şadırvan and garden.\n",
    "2_28": "Cultural meanings encased inside aesthetically shaped material shells, objects trigger intense experience.\n\n\nHappiness Means Being Close to the One You Love, That’s All.\n\n\n[3] To get away from the cars and the crowds that had gathered to sip tea and to get a better view of this, one of the last remaining Ottoman mansions, as it went up in ames, we walked to the other end of Rumelihisarı.\n\n\n[2] Like a sailor who wakes up in a storm and instinctively rushes to his sails, I jumped still half asleep from my bed, closing the open windows one by one and turning off a table lamp that had been left burning, and after doing all this I sat in the kitchen and drank a glass of water as the kitchen’s overhead light swayed in the wind howling through the cracks.\n",
    "2_29": "[1] He turned up a series of wall lights above the reading bench and knelt on a cushion.\n\n\n[3] Anyway, she nearly faints with shame, and she starts to cry and flap her hands about, and then the mullah sits and thinks for a while, and he strokes his long white beard, and he drinks a cup of mint tea with a medium amount of sugar in it, and he smokes his narghile, and then he strokes his long white beard again, and then he goes out for a piss, and then he drinks another cup of tea, and then he gets a little polished stick that he keeps for the purpose, and he puts it up inside his turban and scratches his head with it, and then he says, ‘Daughter, I think I know what your dream means,’ and she says, ‘Mullah Efendi, take away my shame,’ and he says, ‘Daughter, it’s like this.\n\n\n[5] The mullah sits and thinks for a while, and he strokes his long white beard, and he drinks a cup of mint tea with a medium amount of sugar in it, and he smokes his narghile, and then he strokes his long white beard again, and then he goes out for a piss, and then he drinks another cup of tea, and then he gets a little polished stick that he keeps for the purpose, and he puts it up inside his turban and scratches his head with it.\n\n\nHaving close proximity to transportation hubs and several tourist spots, the site receives a lot of visitors and is a popular location.\n",
    "2_30": "I exhibit the thermos filled with tea, stuffed grape leaves, boiled eggs and some Meltem bottles to evoke our Sunday excursion that may offer the visitor some relief from the oppressive succession of interior settings, as well as my own agony.\n\n\nBut neither the reader nor the visitor should on any account think that I could forget my pain even for an instant.\n\n\n[7] In the bustling mahalle, a beautiful eyvan adorned with intricate opus sectile mosaics welcomed visitors to the mosque’s serene courtyard.\n\n\nThe bustling mahalle near the grand külliye introduces an exquisite eyvan adorned with intricate opus sectile mosaics, welcoming visitors into the mosque’s serene courtyard.\n\n\nIt stood as a symbol of communal gathering, relaxation, and purification for both locals and visitors.\n\n\nBy preserving its rich history while embracing inclusivity and sustainability, the hamam continues to serve as a bridge between the past and the present, offering an immersive cultural experience for visitors and contributing to the social.\n",
    "2_31": "[5] I should cross the road and head downhill toward the university.\n\n\ntable bustling street markets in Istanbul with reduced packaging, a table like a feather, an Orient bar in the evening with stocked drinks, a mosque complex, religious.\n\n\nAs evening descended, I warmly welcomed guests to our well-stocked bar, discreetly furnished by local delicatessens.\n\n\nI led guests to a stocked bar in our setup, offering drinks.\n",
    "2_32": "When you have bathed there a few times, when you have walked along the shore in the quiet evening under a parasol, breathing the exquisite air, when you have dined in a cafe of old Phalerum built out into the sea.\n\n\nI do not recall being even once able to make a call from a PTT phone booth during that entire period.\n\n\nI do not recall being even once able to make a call from a PTT phone booth during that entire period.\n\n\n[2] At seven that evening I ushered the first guests to the bar we had set up-it was fully stocked with all the requisite foreign liquor bought under the counter from the city’s delicatessens-and like a good host, I offered them drinks.\n\n\n[3] After searching for a long time and carefully weighing all the choices , his choice was the flat on the garden floor of an ashen, fairly old and unkempt but obviously once grandiose apartment building, located in a rather lively neighbourhood on a well-trodden street that opened up to a busy avenue.\n\n\n[3] Today there is virtually nothing left in Eminönü to remind us of the colourful Latin period in the city’s history, other than a few medieval Venetian basements underlying some of the old hans in the market quarter around Rüstem Paşa Camii.\n\n\n[6] At seven that evening I ushered the first guests to the bar we had set up-it was fully stocked with all the requisite foreign liquor bought under the counter from the city’s delicatessens-and like a good host, I offered them drinks.\n\n\n[6] At seven that evening I ushered the first guests to the bar we had set up-it was fully stocked with all the requisite foreign liquor bought under the counter from the city’s delicatessens-and like a good host, I offered them drinks.\n\n\nWe had set up-it was fully stocked with all the requisite foreign liquor bought under the counter from the city’s delicatessens.\n\n\nI ushered the first guests to the bar we had set up-it was fully stocked with all the requisite foreign liquor bought under the counter from the city’s delicatessens.\n\n\nWith utmost care and deliberation, we settled on OMA as the optimal host for our design endeavors.\n",
    "3_0": "The combination of historical architecture, waterfront views, and the bustling local atmosphere gives Uskudar Square a unique charm and character that appeals to a wide range of people.\n\n\nImmerse yourself in the atmosphere of the Orient bar’s unique charm.\n\n\n\" You take delight not in a city's seven or seventy wonders, but in the answer it gives to a question of yours.\n\n\nEngaging in tea consumption atop the roof has nearly evolved into a conspicuously prevalent practice, illustrating a quintessential manner of utilizing Istanbul's rooftops.\n\n\nAs can be seen from the data in the figure, 99% of its content is recognized as 'Speech'.\n\n\nRemembering something through 'touch' is remembering the tactile feeling it gives.\n",
    "3_1": "Objects within a space have the power to shape its character, and when they are strategically placed and thoughtfully curated, they can greatly enhance the emotional response of those who inhabit it.\n\n\nThese peculiarities contribute to the individuality and character of each object, making them distinct entities within the social space.\n\n\nIn her seminal work from 1961, Jane Jacobs offered a comprehensive critique of modern urban planning practices, characterizing it as a \"pseudoscience\" with a problematic preoccupation for replicating failed empirical approaches and disregarding successful ones.\n\n\nOwing to Marco Polo's civic and poetic inclinations, we have employed 60 foundational bottom-up theoretical works to encapsulate the essence of Marco Polo's character.\n\n\nThis gradual fusion between the prototype and Istanbul's distinctive character orchestrates a transformation, manifesting itself as an ongoing dialectical tension characterized by the interplay of top-down and bottom-up influences.\n\n\nSimultaneously, the setting can drive the narrative forward, making it easier for audiences to understand and emotionally resonate with the characters.\n\n\nIn \"The Accidental Spy\", the backdrop is the static streets of Istanbul, while the action of characters running through forms the plot that takes place over this backdrop.\n\n\nThe public attributes of the backdrop contrast sharply with the characters' actions.\n",
    "3_2": "These objects provide a glimpse into the characters’ lives, thoughts, and emotions.\n\n\nObjects within a scene can be used to convey important information about the setting or the characters themselves.\n\n\nScene capturing Orient Bar ambiance, little white hut housing dyeing workshop, graffiti-adorned houses adding character, city’s delicatessens essence.\n\n\nThis dichotomy, stemming from divergent schools of thought, is perceived as a universal urban archetype.\n\n\nIt presents the city as a patient needing treatment, with the urban character being the primary focus of the problem.\n\n\nMost of arthouse films concentrate on characters, highlighting their activities with a still scene.\n\n\nObjects often carry a wealth of information: they might foreshadow connections between characters, the progression of the story, or embody a certain emotion of a character.\n\n\nDuring our field trip, we journeyed across Istanbul, capturing footage of not only iconic landmarks and popular tourist destinations but also everyday scenes that offer valuable insights into the character of the city's spaces.\n\n\nThe Fragments are the main body for showcasing the characters of city scenes in different versions, with particular spaces they render the city physically as well as create interactions with viewers.\n",
    "3_3": "The background to Jane Jacobs' book is the proposed construction of a highway in Greenwich Village, where she lived, by New York city planner Robert Moses in 1955.\n\n\nHe saw this process as similar to chess, where the rules determined the specific game.\n\n\nIn the book \"Istanbul: Memories and the City,\" a specific childhood recollection set in Beşiktaş was deliberately selected.\n\n\nSetting Name: This refers to the specific designation of the location where the envisioned urban scene unfolds.\n\n\nThis system effectively groups these input elements with previously clustered Istanbul elements that share similarities based on specific features.\n\n\nThis project delves deeper into this process and decides to focus the exploration on three specific senses: sound, visual, and touch.\n\n\nThe memory tracks of certain objects are extracted in the history of Istanbul, which have a very Istanbul-specific tactile experience.\n\n\nThe cinematic environment provides a temporal and spatial context for the story, creating specific atmospheres and emotional tones for the film.\n\n\nZooming in specific objects requires lens with shorter focus, sometimes lead to a vague of background.\n\n\nContrarily, shoting scenes of large background with long focus lens create a general context, yet influense of objects are much ignored.\n",
    "3_4": "They provide insights into how specific spaces and buildings interact with their surroundings, offering proven solutions to recurrent urban challenges.\n\n\nSubsequently, the SOM proceeded to cluster the images of architectural elements, de-dimensionalizing the high-dimensional visual complexity of Istanbul's urban landscape by utilizing the preset grid dimension.\n\n\nBesides, the corresponding films are displayed as the background to the landscape groups that completes the context.\n",
    "3_5": "Exploring these objects provides insight into the complexities of human emotion and the importance of cherishing our memories.\n\n\nThey are not just static artifacts but fragments of individual experiences and memories.\n\n\nIncorporating dynamic and interactive elements into these objects not only introduces an element of surprise but also elevates users’ experiences by infusing the space with a sense of excitement and novelty.\n\n\nObjects and experiences become the props and scripts we use to create our own individual dramas.\n\n\nThrough his recollections and reflections, Pamuk imbues the city with his own emotions and experiences.\n\n\nThus, the cycle perpetuates, with each generation passing on a similar common sense to the next, informed by their lived experiences and the urban landscapes they have known.\n\n\nCommon sense is an individual's interpretation of the world, it is constructed by analyzing and learning from the experiences one has while growing up.\n\n\nThe grayscale image can provide insights into the temporal and frequency distribution of sound classes in the audio signal.\n\n\nThrough effective editing, directors can control the pace of the story, amplify emotions, establish connections, and create meaning.\n",
    "3_6": "Actions, emotions, and existence are intertwined, creating a complex web of relationships.\n\n\nFollowing the Lumière brothers, Auguste and Louis, who held their first private screening of projected motion pictures in 1895 - a milestone often referred to as the birth of cinema - film began to emerge as a new and more effective way to depict urban life.\n",
    "3_7": "In some of the areas, this city experience is fading out, it is worried that it may disappear or even be sort of forgotten one day.\n\n\nThese experiences can be seen as the dataset that influences one's way of thinking.\n\n\nThis diagram basicly shows the relationship between the fundamental elements, how they interact with each other and generate new intergrate one.\n",
    "3_8": "In this final implementation the authors interacted with the latent space to process and extract the main features of the constructed Istanbul Museum of Modern Art's artwork collection from the computer's point of view.\n\n\nThen the 'forgotten point’ is selected and the process of 'reactivating' begins.\n\n\nAfter this point, the authors actively search for similar elements to the original sound and layer them iteratively on top of the critical point sound.\n\n\nWith the MST similar segments are grouped together, clearifying the highlighted part of the geometry observed from the viewing points.\n\n\nThe highlighted parts of geometry from each view point are cropped with the masks of segments.\n",
    "3_9": "They  point  out  to  you  the  place whence  the  cock  crew,  and  the  balcony  from  which  Pilate showed  Jesus  to  the  assembled  multitude,  or  rather  the facsimiles  of  those  spots.\n\n\nThey  point  out  to  you  the  place whence  the  cock  crew,  and  the  balcony  from  which  Pilate showed  Jesus  to  the  assembled  multitude.\n\n\nThe prompt crafted is used as input in Point-E Model which helps to generate a point cloud, which is further processed to produce a mesh  of the object.\n\n\n[1] He pointed to the paper and pens sitting on the table.\n\n\nAn affordance points both ways, to the environment and to the observer.\n\n\nTherefore, after straightening the observation path, in order to keep the relative distance between the line of sight focus and the corresponding point on the path still, the geometry will shift position as the line of sight focus moves, resulting in overlaps.\n\n\nAs extracting segmented geometries on different viewing point all along the path, the relative positions of viewing points and segments are fixed.\n\n\nViewing points are lied through the time path, on which each group of segmented geometry is located with the order that it appeared on the time path, and placed through the fixed relative positions with viewing points.\n",
    "3_10": "This process involved navigating ArchDaily's structure, identifying key data points, and efficiently gathering this information.\n\n\nWhen people start to forget something, they somehow still remember the key features of the audio, even the original sound is not as clear as before.\n\n\nIn the second step, the authors superimpose the audio that is in second place, and so on, until the previous step where the key feature is no longer recognizable.\n\n\nThis 5-second sound is the data basis for the later stage.\n\n\nTherefore, it is needed to determine the point where the reactivation should start and how to recall the memory through 'touch'.\n\n\nTherefore, in the second attempt, the authors first need to get the tactile feeling keywords of the texture using AI, then rank them according to their importance level.\n\n\nHowever, if the memory needs to be recalled, the forgetting process should stop when there is only the last key tactile feeling left.\n\n\nTherefore, the recalling process starts with the last key tactile feeling that remains.\n\n\nWhen starting to remember it, the most important feeling is remembered the first, then the less important details are remembered accordingly.\n",
    "3_11": "[1] As he cleared away into sacks, he sang: “I wanted to go fishing And I needed a mouse for bait So I sent out the cat to fetch one.\n\n\nThe profound and layered prose of the memoir allows for an intimate connection between the reader and the city, making it a key protagonist in the narrative.\n\n\nThis involved implementing necessary modifications to accommodate the needs and preferences of all visitors while remaining respectful of the hamam's historical integrity.\n\n\nActivities are the primary events that take place over the backdrop.\n",
    "3_12": "[2] The predecessor of this modern bridge across the Golden Horn was an iron pontoon structure of 1909–12.\n\n\nFor example, if people hear different types and tones of language at the same time, they will not remember the specific content, but form the impression of 'this is a noisy alley' instead.\n\n\nThis mechanism allows again reinforcing the impression of the primary feature.\n\n\nBy analyzing features of the four film genres, four types of materials are selected to merge their features and emphasize the context of Fragments.\n",
    "3_13": "The reimagined versions of the objects are inserted back into the street.\n\n\nThis allows it to determine the relevance of data to a given query in extracting meaningful features from data.\n\n\nThe 3Dresnet has two kinds of modes, score, and feature.\n\n\nTake an example of a street view on a street from Google.\n\n\nTake the simit bread as an example, its memory can be tracked back to 1900s.\n",
    "3_14": "The ultimate aim is to generate an infinite range of possibilities for knowledge creation.\n\n\nThe author lived in Istanbul for several years and draws on his deep familiarity with the city to create a vivid portrait of its culture, history, and people.\n\n\nBy embracing sustainability, the renovated Hürrem Sultan Hamamı aimed to set an example for future heritage preservation projects.\n\n\nIt is only in the final stages of the project that the latent state design transitions from this abstract computational realm back into the tangible world, reintegrating the design into its physical context.\n\n\nTherefore, in the second attempt, the authors aim to solve these two problems.\n\n\nAnd this kind of straightforward translation is difficult to see the whole picture of sound culture, let alone extract the cultural core that can truly support the project's transition back to the tangible world.\n",
    "3_15": "The aim is to transform ordinary, mundane spaces into vibrant living rooms of the city, that narrate stories of its people.\n\n\nThe former residents may remember the neighborhood as a place where people from different religions and cultures lived and worked side by side, where they had close connections with their neighbors.\n\n\nlt's a place where the past and present exist side by side, where different cultures and religions intermingle, and where the very concept of identity is constantly being challenged and redefined.\n\n\nThere are many subjects and places where a film can be made in Istanbul.\n",
    "3_16": "In other words, when using score mode, the model will output a list of scores of 400 activities for every 16 frames in a video.\n\n\nIstanbul, in its own distinctive voice, communicates that what appears to be a staircase is in fact akin to a roof within its context.\n",
    "3_17": "In terms of the urban landscape, three typologies of spaces are selected in the context of the concept to focus on: rooftop, alley, and underground.\n\n\nWhile roof is public and open to the surroundings, it has a unique sense of privacy as it is not easy to be noticed.\n\n\nAlley is the main carrier of various events, it connects the roof and the underground.\n\n\nThe underground mainly refers to the underground reservoirs and tunnels that are left over from the history.\n\n\nIn Istanbul, due to the lack of freshwater resources in the past, large-scale underground cisterns have been built underground in many large public buildings.\n\n\nThe underground space is enclosed, and it is also a public space with a sense of privacy.\n\n\nWhat's interesting is that the privacy of the underground space is different from the one of the rooftop.\n\n\nFor example, the received information is divided into three categories: 'nature', 'human', and 'mechanical', to analyze the different performances of the five senses in 'roof', 'alley', and 'underground' spaces.\n\n\nThrough observation, it can be found that the 'mechanical' information on 'roof' is relatively limited, and the part of 'nature' in 'underground' is relatively limited.\n",
    "3_18": "In addition, the original scene is reconstructed using everyday scenes such as rooftops, streets, and undergrounds of forgotten spaces fed into a trained autoencoder to generate a visualization of the results.\n\n\nWe will use the high-frequency sound model for the roof, the mid-frequency sound model for the alley, and the low-frequency sound model for the underground.\n\n\nIn this project, the high frequency model is used for the rooftop spaces, the medium frequency model is used for the alley spaces, and the low frequency model is used for the underground spaces.\n",
    "3_19": "These forgotten spaces left a trace in the memory of Istanbul.\n\n\nLarge objects can also be divided into different parts with smaller scales.\n\n\nBy blend the path segmented geometries are spinning, showing off different parts with different angles.\n",
    "3_20": "\"Istanbul: City of Memories\" is a book by Orhan Pamuk that explores the city of Istanbul through the lens of personal memory and experience.\n\n\nSound is an important part of Alley's memories, especially in Istanbul.\n\n\nSo when investigating hearing as part of memory in Istanbul.\n\n\nThis passive input memory is constantly revised according to the changes of the alley, until the most primitive sound memory is completely revised.\n\n\nUntil the most prominent feature of this original memory disappears.\n\n\nThe authors refer to this plausible change as the \"recalling\" of the memory.\n\n\nThe authors refer to this plausible change as the \"reactivation\" of the memory.\n",
    "3_21": "Memories of Berchtesgaden and GIs seeking souvenirs flooded Ben’s mind.\n\n\nIn summary, we arrived at the resolute decision to embrace \"Istanbul: Memories and the City\" as our theoretical focal point—an optimal choice that resonates as a definitive repository of our chosen site's cultural and emotional heritage.\n\n\nThis particular memory possesses an inherent equilibrium, offering a well-rounded portrayal that encapsulates both the atmospheric essence of the place and the intricate emotional landscape of the author.\n\n\nFurthermore, the selected memory's length falls within an optimal range, ensuring a balanced and engaging narrative that resonates effectively with readers.\n\n\nIt’s interesting that memories are often created in a public environment, yet they are very personal to the owner of the memories.\n\n\nInput a photo of Istanbul as a memory of Istanbul.\n\n\nWhile reactivating the memory, the authors interact with the encoding within the neurons.\n\n\nWhen recalling a memory, the features that stand out the most to the memory owner are recalled first.\n\n\nOver time, when revisiting this memory, the memory owners are actually recalling what they recalled last time.\n\n\nAs the memory owner cannot fully recall all the details, the memory needs to be reactivated with new audio data.\n\n\nThe first time this memory being recalled is constructing an understanding to the memory owner based on the tactile feeling it gave.\n\n\nTherefore, it's not exactly the same feeling when the memory owner touches it.\n\n\nAt this point, recalling the memory of this tactile feeling is recalling the memory that is being remembered from the last time and constructing the understanding based on the last piece of the memory.\n",
    "3_22": "The first part is to simulate visually how people forget.\n\n\nAs time goes by, they start to forget the least important details first, then forget the less important details in the memories bit by bit.\n\n\nStarting to forget the memory is actually forgetting the understanding constructed earlier.\n",
    "3_23": "A kebab photograph with Istanbul characteristics is selected for various degrees of Gaussian blurring to simulate the process of people forgetting.\n",
    "3_24": "Throughout the design process, we thoroughly explored the potential of incorporating various literary works to encapsulate the essence of Istanbul.\n\n\nThis meticulous selection process underscores the careful consideration that went into curating a memory that not only captures the essence of Istanbul but also aligns seamlessly with the thematic undertones of the book.\n\n\nThe Audio Classification chart shows the intensity of various sound contents in audio at various times.\n\n\nAs an example, when we focus on  'mosque', it is interpreted in various way in different films, through the time line.\n\n\nEditing involves selecting, combining, and arranging various shots in a film to create a continuous and cohesive narrative.\n",
    "3_25": "Through this dynamic interplay, we craft a replacement paragraph that is not only tailored to Istanbul's essence but also retains the essence of the chosen persona, thereby generating an extended and seamlessly integrated narrative.\n",
    "3_26": "“The city is a theater, a stage where we perform our lives.\n\n\nObjects that are relevant to the streets of London are considered and are reimagined using Istanbul texts to bring in the essence of Istanbul in London.\n\n\nThis approach, at the time considered revolutionary, remains relevant today.\n\n\nThe two results can represent the combination of the top-down and bottom-up development process of the city, and at the same time, we can understand the appearance of the city constructed from different perspectives.\n\n\nThe ensuing stage involves the strategic replacement of the original input text with words attributed to either Polo or Khan, a process that grants designers the freedom to choose between top-down and bottom-up approaches.\n\n\nThrough this innovative synergy, we stand on the verge of unveiling one amongst a limitless array of alternative iterations encapsulating the essence of Istanbul.\n",
    "3_27": "Since these texts are in the context of Istanbul, the renders closely reflected iterations of the object that made them Istanbul-specific.\n\n\nThis curated approach allows to design spaces that resonate with the essence of Istanbul and its people.\n\n\nFüsun gracefully approached the table, sitting across from me in silence.\n\n\nThis approach facilitates a design workflow navigated primarily through text, enabling designers to fluidly oscillate between these two distinct schools of urban theory.\n\n\nEach of these countless small narratives, interwoven through this software-driven approach, contributes to the composition of the city.\n",
    "3_28": "As the city evolves and grows, it is imperative to preserve its essence and honour its past while creating a promising future.\n\n\nThroughout life’s journey, these objects become tangible markers that hold profound meanings, encapsulating treasured memories and reflecting the values that define individuals.\n\n\nIt encourages people to reflect on the value of their own experiences and the memories that make up their lives.\n\n\nCities are not mere material entities; they become a text, inviting different interpretations and experiences, turning the urban landscape into a multidimensional book read by pedestrians and residents who construct their own meanings and narratives within it, continuously in time.\n\n\nObjects cease to be passive observers of the city; they become active participants in shaping how people experience and perceive their surroundings.\n\n\nTogether, the policies provide a comprehensive understanding of urban development from two distinct angles.\n",
    "3_29": "My father’s death had turned all the familiar props of my childhood into objects of immeasurable value, each one the vessel of a lost past.\n\n\nA list of objects that frequently appeared on the streets of Istanbul was put together to further explore.\n\n\nBased on the curated object list, ArcGIS was used to find out what its distribution looked like and that in turn, gave a list of coordinates of these objects for further examination.\n\n\nThe comfort of seeing the past, present and future in film allows the individual to compare Istanbul according to its periods, while ensuring that the city is not forgotten.\n",
    "3_30": "As Istanbul transforms into a modern metropolis, Kemal struggles to reconcile his past with the new realities of the present.\n\n\nIn this intricate process, the architectural elements within this chosen project assume the role of visual presentation and embodiment, akin to blood and flesh, arranged meticulously through our artificial eyes of the elements of Istanbul onto our urban prototype.\n\n\nLikewise, when a ramp is presented to Istanbul, it responds by gently shaking its head and asserting that the element resembles a staircase within its own milieu.\n\n\nNext, four groups of landscapes are organized, which are gathered through differences of genres.\n",
    "3_31": "",
    "3_32": "He brought untouched paper like a mother cat with a wounded bird.\n\n\n[6] They had lunch at a fish restaurant underneath Galata Bridge, Kay facing the old city, the postcard view of slender minarets and domes behind a kite tail of circling birds.\n\n\n[7] When I told him, “Yes, that’s all,” he went to the door with the superior air of a master who caught an apprentice stealing; he brought in a roll of paper untouched by the rain, and placed it before us three artists like a mother cat bringing a wounded bird to her kittens.\n\n\n[2] Three years before his death, on the day he moved out of the City-of-Hearts Apartments and into his new home in a back street, Mehmet Sabit Bey (Grandfather) had marked the occasion by sitting down in his wobbly old armchair, which no longer faced the window as in the old apartment but still faced the radio, which still sat on the same heavy table.\n\n\nbalcony, uncomfortable, wobbly old armchair, window, old apartment, long white beard, polished stick, turban, head, dream, restaurant.\n\n\n[7] Main Bathroom The walls of this bathroom are revetted in finest Egyptian alabaster, while the taps are solid silver.\n\n\nMehmet Sabit Bey had marked the occasion by sitting down in his wobbly old armchair, which no longer faced the window as in the old apartment but still faced the radio, which still sat on the same heavy table.\n\n\nwobbly old, old apartment, heavy table, other side, mosque complex, final triumph, iconodules, Easter Sunday, huge mosaic,  little polished stick.\n\n\nsitting down in his wobbly old armchair, which no longer faced the window as in the old apartment but still faced the radio, which still sat on the same heavy table.\n\n\nThe main bathroom features walls revetted in Egyptian alabaster and solid silver taps.\n\n\n\" Under the seeming disorder of the old city, wherever the old city is working success[1]fully, it is a marvellous order for maintaining the streets' safety and the city's freedom.\n\n\nunder the seeming disorder of the old city, wherever the old city is working successfully, is a marvelous order for maintaining the safety of the streets and the freedom of the city.\n",
    "4_0": "Moreover, the impact of cybernetics on urban planning can also be seen in the conceptualization of the city as a system, as demonstrated by models such as the \"plug-in city\" and Crompton's \"Computer City Project\" from 1964.\n\n\nEmpirical studies by several authors have illustrated that the inadequacy of contemporary city systems is rooted in outdated urban planning practices, which are perceived to have been unable to effectively handle the intricate components of cities, particularly the technological ones (Firmino, Aurigi & Camargo, 2006;  Cowley & Caprotti, 2019;  Van Hulst, 2012;  Graham, 1997).\n\n\nWe do not mean to personify these properties of social systems by implying malicious intent.\n\n\nThis perspective was challenged by Jacobs, who viewed the complexity of the lived city as being defined by its localized and social characteristics, rather than the controlled and centralized city system represented by the proposed road.\n\n\n“Elements of Architecture looks at the fundamentals of our buildings, used by any architect, anywhere, anytime: the floor, the wall, the ceiling, the roof, the door, the window, the façade, the balcony, the corridor, the fireplace, the toilet, the stair, the escalator, the elevator, the ramp…Only by looking at the elements of architecture under a microscope can we recognize the cultural preferences, forgotten symbolism, technological advances, mutations triggered by intensifying global exchange, climatic adaptations, political calculations, regulatory requirements, new digital regimes, and, somewhere in the mix, the ideas of the architect that constitute the practice of architecture today…”(OMA.\n\n\nAs a constituent sub-system within the complex urban system, each architectural element's presence is not merely regarded as a design consideration for architects on a case-by case basis.\n\n\nBy deconstructing an architect's body of work within the Istanbul context, we gain the ability to cherry-pick a storyteller whose narrative aligns seamlessly with the Istanbul essence.\n\n\nThis software not only amplifies the potential of our methodologies but also serves as an accessible tool for architects to seamlessly adopt within their individual narrative contexts.\n\n\nEach architect can then imbue the method with their own narrative, thereby dispersessing the inherent contradiction embedded within linear workflows, giving rise to an expansive array of individualized narratives.\n\n\nRemembering something through 'touch' is remembering the original tactile feeling that the texture gives.\n\n\nThen these 9 tactile adjectives can be seen as the tactile feeling that the texture gives and used as prompt later.\n\n\nThen these 9 tactile adjectives can be seen as the tactile feeling that the texture gives and used as prompt later.\n\n\nTherefore, Film serves as an exceptionally apt medium for capturing the diverse and complex character of Istanbul.\n",
    "4_1": "It is also interesting to note that an early use of the term ‘smart city’ by Hall in later literature as:Designed, constructed and maintained, making use of advanced, integrated materials, sensors, electronics, and networks which are interfaced with computerized systems com[1]prised of databases, tracking, and decision-making algorithms … At the most superficial level is the fundamental component and its associated \"feedback\" or self-monitoring mechanism(s).\n",
    "4_2": "",
    "4_3": "For videos in which the scenes need highlighting, a still image including the scene is extracted as the original image for the image classification model.\n",
    "4_4": "Scene Form: This element is concerned with the visual composition of the scene itself.\n\n\nTo gain insights into urban typology for informed design decisions, data was sourced directly from ArchDaily.\n\n\nConsequently, this informs their design approaches when they become the creators of such spaces and they tend to design the city with their common sense.\n",
    "4_5": "Film, as a visual art form, conveys stories, emotions, and information through various technical means.\n\n\nA frame is the basic unit of film or video, which can be understood as individual still images.\n",
    "4_6": "The goal is to create a seamless integration of historical and contemporary narratives within the existing urban fabric.\n\n\nIt can be seen that the generated sound can still be well recognized as 'Speech'.\n",
    "4_7": "By using cinematic elements such as narrative, cinematography, and sound, filmmakers are able to highlight the contrasts and harmonies that make Istanbul a uniquely layered city.\n",
    "4_8": "",
    "4_9": "When recalling a sound, the first step is to recall what elements are there, and then it’s needed to think about how those elements are arranged.\n\n\nThe X-axis represents the steps in the whole process, for enample the first geometry appears at the 4th step.\n\n\nBy overlapping the geometries along the path, viewers can see the four films once at a time.\n",
    "4_10": "",
    "4_11": "",
    "4_12": "The mosque was once surrounded by typical külliye structures including an imaret, a medrese, and a mektep.\n\n\n“ … there is a fundamental law about the creation of complexity …(which) states simply this: all the well-ordered systems that we know in the world, all those anyway that we view as highly successful, are generated structures, not fabricated structures.\n\n\nKublai Khan viewed cities as having a perfect molecular structure, much like diamonds, which could be understood once the structure was mastered.\n\n\nThe continuity of sound is utilized to obtain the coordinates of the visual structures and to solidify the visual structures according to the sound intensity.\n\n\nNext, the textures generated using the touch model are used to apply details to the visual structures and enhance the architectural proposition physically.\n\n\nBy rebuilding the viewing path to a circle or a curve of particular shape, the fragments are reset into structures and form a compact space with stronger context.\n\n\nThe supporting structures coexist with the Fragment for the purposes of supporting and/or constructing spaces.\n\n\nFor spy films, which often feature a lot of gunfights and action, a metallic structure has been used.\n",
    "4_13": "",
    "4_14": "This understanding enables its application in comprehending future architectural projects from an Istanbul-centric standpoint.\n\n\nAn affordance cuts across the dichotomy of subjective-objective and helps us to understand its inadequacy.\n",
    "4_15": "We hold the belief that every architectural element possesses distinct affordances within varying urban contexts.\n",
    "4_16": "",
    "4_17": "SOM is used as a medium to find connections among clusters of objects and spaces.\n\n\nPublic urban space has been one of the prominent subjects of photography since the birth of the medium around 1838.\n",
    "4_18": "The objects on the street contributed to how an urban space is perceived and experienced.\n\n\nThe objects and space list are used as keywords and using the Skip-gram Word2Vec model, sentences that included both, the keyword and the most similar word to it are extracted and vectorised.\n\n\nThe SOM trained on objects and space list is used as a design tool.\n\n\nActors and Scripts: This pertains to the integration of programmatic elements and activities intrinsic to the urban space.\n\n\nUse the qualitative notion of memory as a mechanism and sensory data as an instrument to repaint the forgotten spaces in the city by adding a temperament to the existing urban context through the lens of collective recollection.\n\n\nThe relative positions of domes and walls are mostly kept to reserve a new space, which, though differ in scale, conveys a similar yet creative context as the real indoor spaces of mosques.\n",
    "4_19": "",
    "4_20": "Upon successfully training the SOMs, we enter the realm of utilizing our methodology in tandem with input text, specifically the paragraph extracted from \"Istanbul: Memories and the City.\n\n\nTherefore, when people are looking at the same thing, like the David statue, they would make different associations and have different memories of it.\n\n\nImages with different degrees of blurring are matched to indicate how memories are forgotten at different extent.\n",
    "4_21": "It is within this context that we've chosen to draw upon \"Istanbul: Memories and the City,\" authored by Orhan Pamuk.\n\n\nTherefore, in the first attempt, modeling the process of remembering and forgetting for the visual memory is by visually blurring the object first.\n",
    "4_22": "In addition, to simulate the forgetting process in the first attempt, the keywords are deleted in a random order.\n",
    "4_23": "A representative piece of audio is selected for more exploration.\n\n\nFor the third attempt, they will try the 'Granular Synthesis' approach to this process.\n",
    "4_24": "Different books related to Istanbul are scraped from various websites.\n",
    "4_25": "",
    "4_26": "Reflecting the essence of the project's title, \"Invisible City In-Between\" ,our work resonates with the themes explored in Calvino's book.\n\n\nIt unveils the potential for 55 unique urban iterations within an instant, demonstrating the captivating interplay of urban dynamics in real-time.\n\n\nThis conception mirrors the very essence of our overarching theme: that a city evolves as a dynamic interplay between top-down and bottom-up influences.\n",
    "4_27": "As people interact with these elements, stories are exchanged, shaping the city’s identity and essence.\n\n\nThrough this innovative approach, we are capable of redefining architectural elements in a manner that transcends the confines of artificial typologies that were established previously.\n",
    "4_28": "Situated at the crossroads of the Eurasian continent, Istanbul boasts an urban complexity that far surpasses that of many other cities.\n\n\nThe resultant configuration symbolizes the essence of our message—to perceive the city as an ever-evolving arena of conflicting forces.\n\n\nWrite a program to superimpose the gray values of the sounds in the same group, according to the previous results from Word2Vec.\n\n\nEach era, group and people has its own interpretation of it.\n",
    "4_29": "They argued that the problems faced in cities, such as inequality, civil unrest, and urban renewal, could not be addressed with a simple, scientific approach because they are shaped by diverse values and constantly changing contexts.\n\n\nThis transformation results in the fragmentation of the contradiction into myriad small narratives, akin to individual pieces within a larger mosaic.\n\n\nSeveral factors have contributed to the decline of the Balat neighborhood, including economic changes, migration patterns, aging infrastructure, gentrification, etc.\n\n\nThe higher the value of the grayscale data, the higher the \"purity\" of the sound category at this moment.\n",
    "4_30": "Within the context of the dialogue, Khan predominantly symbolizes the aspects of governance and regulations within the urban landscape.\n\n\nThe Urban prototype, imbued with the contextual essence drawn from the perspectives of Marco Polo, Khan, and with assistance of Orhan Pamuk, stands poised as the cornerstone of our design endeavor, providing the fundamental underpinning for all ensuing creative manifestations.\n\n\nFollowing the acquisition of our replaced urban prototype, the next phase involves the iterative development of our design, centering on the exploration of contradictions and oppositions within urban design.\n\n\nNext, use the grayscale value data to adjust the volume of the time period corresponding to this audio, so as to obtain new audio that matches the grayscale data.\n",
    "4_31": "Thus, the whole thing is scattered about inside me, the rooms, the stairs that descend with such ceremonious slowness, others, narrow cages that mounted in a spiral movement in the darkness of which we advance like the blood in our veins.\n\n\nIt becomes imperative for us to identify an Istanbul that resonates on a deascriptive plane, thus facilitating a seamless connection and comprehension for both theoretical personae.\n\n\nThis prototype, in a dynamic interplay, becomes incrementally intertwined with the contextual nuances of Istanbul through the continuous oscillation between divergent viewpoints presented within the dialogues.\n\n\nThis junction serves as a pivotal juncture where our urban prototype is harmoniously linked to Istanbul's contextual dynamics.\n\n\nUrban prototypes, or architectural types, serve as foundational models in urban design.\n\n\nThis process enables us to imbue our urban prototype with narratives uniquely flavored by the spirit of Istanbul.\n",
    "4_32": "We use the term ‘wicked’ in a meaning akin to that of ‘malignant’ (in contrast to ‘benign’) or ‘vicious’ (like a circle) or ‘tricky’ (like a leprechaun) or ‘aggressive’ (like a lion, in contrast to the docility of a lamb).\n\n\nThe occasional misinterpretations by our classification model—like conflating walking with marching.\n\n\nThrough the utilization of the TF-IDF (Term Frequency-Inverse Document Frequency) model, we have achieved a successful connection between our urban prototype and OMA's extensive project library.\n",
    "5_0": "Istanbul’s mesmerizing allure and rich cultural heritage are a reflection of its diverse history and captivating charm.\n\n\nThe mementos preserve the colors, textures, and delights as they were more faithfully, in fact, than can those who accompanied us through those moments.\n\n\nEach individual engages with the city from their unique perspective, constructing their space in the city with multiple meanings.\n\n\nJane Jacobs introduced a novel perspective on urban planning by emphasizing the importance of the chaotic, small-scale, and social characteristics of a place, as well as diversity.\n\n\nWithin the dialogic framework, Marco Polo showcases the complexity and diversity inherent to the cityscape.\n\n\nAccording to Robert Venturi and other influential architects, the true essence of a space is defined by the actions and interactions that unfold within it.\n\n\n\" To achieve this, we gathered a substantial dataset of images showcasing diverse architectural elements extracted from buildings in Istanbul.\n\n\nOnce the Istanbul SOM framework is established, it becomes capable of accepting input images of architectural elements from diverse projects, irrespective of their architectural origin.\n\n\nViewed as an extensive assemblage of narratives, a city can be perceived as a canvas where architects emerge as creators of diverse stylistic stories.\n\n\nThe extensive array of their works not only ensures diversity in the results but also resonates with the overarching goals of our project.\n\n\nThis insight suggests that, according to Istanbul's perspective, the input image is likely intended to primarily serve purposes aligned with a staircase.\n\n\nThis insight suggests that, according to Istanbul's perspective, the input image is likely intended to primarily serve purposes aligned with a roof.\n\n\nEmphasis was placed on ensuring that the hamam became a welcoming space for individuals from diverse backgrounds, genders, and orientations.\n\n\nThrough the provision of this interactive software, we democratize this innovative approach, making it available for adoption across diverse architectural practitioners.\n\n\nThe city, in essence, becomes an embodiment of the perpetual interplay and reconciliation between these diverse perspectives—a living embodiment of the multifaceted dialogue between top-down directives and bottom-up initiatives.The residents of Istanbul were used to making a living by the fisheries, it can be noticed that they have this impression of walking down the streets while they can view the sea.\n\n\nObserving Istanbul, it becomes apparent that numerous locations within the city were once vibrant melting pots, where individuals from diverse religious and cultural backgrounds coexisted, worked, and forged strong bonds with their neighbors.\n\n\nThe music, in essence, becomes the language with which the city speaks.\n\n\nThe music, in essence, becomes the language with which the city speaks.\n\n\nWhen people are remembering the feeling of touch a piece of texture, they remember the tactile feature that the texture gave.\n\n\nWhen recalling the memory of the texture, people are actually constructing the texture based on the tactile feeling that left in their minds.\n\n\nTherefore, the texture recalled is something similar, but different from the original memory.\n\n\nIn the first attempt, tactile feelings based on the memory owner’s own understanding of the texture are listed, which is limited and relies too much on their own subjectivity and understanding of the texture.\n\n\nConvert the image into 3D texture using a normal map and blender.\n\n\nTake this texture image as input for Google Vision AI to identify the possible contents within the image, then extract the nouns within the contents.\n\n\nAt the end of the remembering process, input the tactile feeling adjectives, together with the word 'texture', as prompt input to Stable Diffusion, to reconstruct the texture.\n\n\nConvert the image into 3D texture using normal map and blender.\n\n\nTake this texture image as an input for Google Vision AI to identify the possible contents within the image, then extract the nouns within the contents.\n\n\nAt the start of the recalling process, input the most important tactile feeling adjective, together with the word 'texture', as prompt to Stable Diffusion, to construct the texture.\n\n\nA few textures from the complete \"Remembering + Forgetting + Recalling\" process are selected to be 3D printed as the physical models, which allows the generated textures to be felt by \"touch\".Hagia Sophia was originally buit as a church during the reign of Byzantine Emperor, and coverted into a mosque in 1453.\n\n\nFilms provide abundant resources to explore the diverse facets of Istanbul,  each film relating to lstanbul has its own perspective, focus, and narrative towards the city.\n\n\nEven the same scene can be showcased in diverse style, expressing multiple narrative of Istanbul.\n",
    "5_1": "All the cells represented on the SOM are the Best Matching Unit (BMU).\n\n\n[5] This mosque complex is the best example in the city of the Baroque style, of which its architect, Mehmet Tahir Ağa, was the greatest exponent.\n\n\nThe Best Matching Unit (BMU) is a fundamental concept in the training algorithm for Self-Organizing Maps.\n\n\n\" Following the steps elucidated earlier, we employ this methodology to project the input text onto the personas of Marco Polo and Kublai Khan, extracting the Best Matching Units from each persona's SOM.\n\n\nWithin each Best Matching Unit, we find clusters of similar text pieces, previously grouped during SOM training, thus constituting distinct families that occupy the same unit cell.\n\n\nThis connection culminates in the identification of the best-matched project: Milstein Hall at Cornell University.\n\n\nAfterwards, the best matching similar results are input into the library of much more diverse objects, to find the best matching images again to simulate the process of remembering and forgetting.\n",
    "5_2": "The list of objects and spaces is used as keywords to search through the corpus of sentences to obtain the best matching sentences in accordance to the similarity scores.\n\n\nThe resulting images are combined to generate a single image, using Image Mixer Model, that emphasizes the important features of each version of the fountain.\n\n\nTF-IDF works on matching text data by assigning importance to each word in a set of documents.\n\n\nAs a result, many of these historically significant spaces have been stripped of their original cultural essence and redeveloped into overly commercialized areas.\n\n\nThe next step is to input the image of the object with different blurring extent to the library of similar objects, then search for the most similar images.\n\n\nFor each image with a different degree of blurring, the most similar images are matched from a dataset of other 'common street vendor' images based on their image characteristics, and the first five results are taken to observe the critical forgetting point.\n\n\nThe best match is selected from the five images obtained and the first five matches are selected again from another dataset containing all the Istanbul memory fragments we have created.\n\n\nThe computer is trained to simulate the process of remembering based on blurring images, the most similar images matched from the common street vendor dataset, according to its image feature.\n\n\nThese images show the first five most similar images, the degree of similarity decreases from top to bottom.\n\n\nIt can be found that when the images are blurred to a certain degree, the structural details of the images become simple and similar.\n\n\nTherefore, when similar images are extracted using the 'common street vendor' dataset, the point at which the matched similar images all become almost identical is the memory forgetting point.\n\n\nThe diagrams with the highest similarity from the second step are matched again with the 'Istanbul image library' to further simulate the recalling process.\n\n\nDuring the observation, the computer uses the image structure to search through the dataset, which is not the same as how the authors intuitively think it should pick the results.\n\n\nIn the first attempt, it was hypothesized that the computer used the image structure to search through the dataset, which was different from expected on how it should pick the results.\n\n\nWhen people see the world from a pure visual perspective, they are scanning through the visual image and identifying the boundaries within the image.\n\n\nAs when people see the world from a pure visual perspective, they are scanning through the visual image and identifying the boundaries within the image.\n\n\nThe Y-axis represents of the 3 fundamental elements we use in the design.\n\n\nUnsupervised learning model is used to seek for the best-matching scenes in four film libraries of the scenes in the original input video, and in this way its four versions are found.\n",
    "5_3": "Using Segment - Anything, Image segmentation is carried out to understand the extent of the influence of the objects.\n\n\nThe objects along with the segments are looked into individually.\n\n\nThe initial scene is segmented using Segment - Anything model to generate individual segments for objects, highlighting the influence that one object can have in relation to the scene.\n\n\nImplementing  in such a manner could lead to significant inconsistencies in design; however, it also opens up a fresh perspective for our creative process.\n\n\nThis integrated approach, bolstered by swift AI-powered image generation rooted in urban theory and Istanbul's contextual fabric, holds the potential for broad application, effectively accommodating significant volumes on a substantial scale.\n\n\nThis understanding can be used to help selecting useful sensory information in the later design.\n\n\nFirstly the auto segmentation of the artwork collection is originated from the fact that when people look at the world through a purely visual perspective, they are scanning the visual image and identifying the boundaries in the image.\n\n\nTo optimize the dataset for visual, only the segmented fragments that has the proportion in the image greater than 0.\n\n\nThen a brounding box is set up for the segments to finish the dataset preparation.\n\n\nSegmentation Algorithm help to recognize objects in the image and export them individually.\n\n\nThe Nearest Neighbour Algorithm  helps to find similarities between segments, and a Minimum Spinning Tree is built for displaying the relativity of segments.\n\n\nWith four groups of segment merged on one line of viewpoints, different versions of one scene can be showcased simultaneously.\n",
    "5_4": "By recognizing their current attributes and associations, they are reimagined with additional semantic information.\n\n\nOn the day of the “grand opening” the people at the clinic had given a showy reception for a bunch of selected guests, and had lined up all the bouquets and garlands right outside at the entrance so that the passersby on the street could be informed about the occasion as well.\n\n\nOn the day of the “grand opening” the people at the clinic had given a showy reception for a bunch of selected guests, and had lined up all the bouquets and garlands right outside at the entrance so that the passersby on the street could be informed about the occasion as well.\n\n\nThe designed objects, which serve as embodiments of the textual descriptions, are then thoughtfully placed back into the street, each carrying the essence of the original text.\n\n\nThis aspect makes it an important contribution to the discourse on Istanbul and a significant representation of the city in literature.\n\n\nUtilizing textual expressions, we are enabled to superimpose the ethereal essence of Istanbul onto our universally applicable framework.\n\n\nTo analyze and match data efficiently, it's imperative to convert multifaceted video data into the textual format.\n\n\nBy converting video data into such detailed textual descriptions, we not only retain the essence of the visual content but also create a format that's amenable to text matching algorithms.\n\n\nThe descriptive text associated with each project constitutes a textual representation that harmoniously intertwines with our earlier urban prototypes.\n\n\nThrough this innovative amalgamation of textual descriptions and visual representations, we foster a deeper understanding of how OMA's architectural stories can seamlessly align with the cultural and urban nuances of Istanbul.\n\n\nBy merging these components with image generation tools such as ChatGPT and Midjourney, we swiftly attain the capability to translate textual descriptions into visual representations.\n\n\nWith further research, it can be found that when visual information is being stored in the brain, the brain prefers to capture the visual information that is relevant to the task at hand, and streamlining and compressing the images people see in the end, while some irrelevant features of the visual information are ignored.\n\n\nWhen people remember visual information, the brain captures visual information relevant to the task at hand and compresses the images seen, while some irrelevant features are ignored.\n\n\nThen return the original sound file through Python and cut the corresponding segment that fits the grayscale data interval.\n\n\nDocumentaries tend to record the city objectively and the information is presented in a factual and informative manner.\n",
    "5_5": "Therefore, we employ GPT to formulate a textual description for each action group, contextualizing the principal activities within.\n\n\nThe quality of the sound is identified by setting the numerical interval of the grayscale data.\n\n\nBy reading information from these images, the autoencoder can identify the characteristics of different sounds.\n\n\nWhen they are forgetting the feeling of touch that same piece of texture, they forget the tactile features gradually.\n\n\nAfterwards, when forgetting the texture through 'touch', people are forgetting the tactile feeling gradually.\n\n\nAfter searching every single scene from the video in the library, the algorithm recognizes the best-matching frame that corresponds to the original one, and outputs the video clip with this frame in the exact middle.\n\n\nThe activity contained by input video is combined with a branch of frames, which can be recognized by the algorithm as a feature.\n",
    "5_6": "However, with the development of Istanbul, the continuous building constructions gradually blocked the view.\n\n\nThe first step simulates how to forget by selecting a picture of an everyday object in Istanbul and gradually blurring it.\n\n\nTo simulate the process of remembering through 'touch', the original tactile feelings of the simit bread are captured through texts, and 5 tactile feelings are listed as keywords.\n\n\nTherefore, the authors remove the tactile feeling keywords one by one.\n\n\nAs the keywords are deleted, the feeling is gradually forgotten.\n\n\nAs the adjectives are deleted, the feeling is gradually forgotten.\n\n\nSince that, this feeling has been completely forgotten and cannot be recalled anymore.\n\n\nTherefore, the tactile feeling gradually adds up to complete the recalling process.\n\n\nIn the movie, there are frames formed from Istanbul,  including the Galata bridge.\n\n\nThe fps of the film  'L Immortelle' is 30, the image shown is one of the frames about mosque Ortaköy in the duration.\n\n\nWhen these frames are played in succession at a certain speed, they create the illusion of motion.\n\n\nAmong all the frames, key frames are selected with certain time gap, and are used for observing the geometry from different viewing points.\n",
    "5_7": "[3] This snack bar was so central one inevitably passed it about ten times a day but mostly because the sharbat was the only new thing in Kars.\n\n\n[8] This snack bar was so central one inevitably passed it about ten times a day but mostly because the sharbat was the only new thing in Kars.\n\n\nA feeling for paradox allows seemingly dissimilar things to exist side by side, their very incongruity suggesting a kind of truth.\n\n\nThis creates a bridge between the pragmatic and the artistic, enabling us to gain a deeper, more layered understanding of the original content.\n\n\nHowever, it is not easy to notice that, when forgetting certain things, despite blurring the memory visually, people’s mind always supplants partially of the original memory with something new but is from their existing understanding.\n\n\nFor the second part, because when forgetting certain things, despite blurring the memory, people’s mind always supplants partially of the original memory with other new things.\n\n\nAs people pass through the alley, sounds from a wide variety activities are produced.\n\n\nIn the original study, YamNet is used to analyze sounds and tried to mimic the process by which these sounds were forgotten.\n\n\nThrough the above steps, a brand-new sound that is very similar to the original sound is obtained.\n\n\nThe original sound represents people's original memory of the sound of the street.\n\n\nAdd new sound of the first class to the original sound.\n\n\nBecause the sounds selected are too random and some are intermittent, our final audio didn't sound artistic and stable.\n\n\nBy micro-sampling these grains, which are typically 5 to 200 milliseconds (ms) long, users can synthesize new sounds and patterns.\n\n\nThis step proves that breaking the sound into particles does not affect the quality of the sound too much.\n\n\nIn \"Unutma Beni Istanbul\", the desolate streets evoke feelings of loneliness, resonating with viewers.\n\n\nThe  remainning fragments are the main body that showcase filmic urban space and create activity with viewers.\n\n\nBesides, by creating own tour ways viewers can create their own orders of observing, which means displaying self-organized films.\n",
    "5_8": "“There is no such thing as chance in a text.\n\n\nAny text is the result of a repertoire, on conscious and unconscious levels, and can only be decoded by someone privy to the same repertoire.\n\n\n[1] And besides, whenever one is in this area one is always tempted to relax at a café or restaurant on the lower level of the bridge.\n\n\nAs we enter, we’re greeted by a spacious and inviting courtyard with a garden on one side and a picturesque graveyard on the other, creating an undeniable temptation to unwind at a café or restaurant on the bridge’s lower level.\n\n\nWhen listening to sounds unintentionally, in order to improve efficiency, the brain usually will recognize limited types of sounds, then simplify and group similar sounds into one category.\n",
    "5_9": "Human bodies, serving as a bridge between the tangible and visible realms, play a crucial role in constructing meaning and navigating the urban landscape.\n\n\nThe objects in the museum represent the preciousness of human experiences, each one with its own story and meaning.\n\n\nOur encounters with the objects in the city are a way of interacting with the layers of human values instilled in them.\n\n\nUrban typologies are essential as they define how spaces function and cater to human needs.\n\n\nSpaces are not just physical entities; they're stages for human activity.\n\n\nFrom this perspective, the architecture isn't just about constructing walls, floors, and roofs; it's about designing spaces that accommodate, enhance, and inspire human activities.\n\n\nIf people think about city, they would instantly think of the centralization of a group of high-rise building blocks.\n\n\nHuman memory loses a lot of details and also fills in with new information.\n\n\nIn other words, the memory process of the human brain is more like writing an outline on a blackboard than like a camera capturing every aspect of the image.\n\n\nThis process simulates how the human brain disassembles and recognizes the sound that people actually hear.\n\n\nThe human brain will associate different contents of sounds with the language system, and classify the sounds to the corresponding labels.\n\n\nThis step simulates the process of the human brain from identifying keywords to generating associations and then obtaining the nearest ones.\n\n\nWhen simulating the process of remembering and forgetting through 'touch', the first thing to do is to think about how humans normally remember and forget a tactile experience.\n\n\nHowever, when thinking about how human brain forgets things, it can be noticed that, at the start of forgetting process, people always remember all the detail feelings.\n\n\nThe film focus on characteristics of the scene, and tries to make explainations objectively dispite of human affections.\n\n\nVlogs are usually made from human's eye shot, and vloggers tend to tell their own stories while showcasing the city to the audiences.\n\n\nThe experiment doesn't include spaces of human scale, yet it provide an inspiration for the following project in terms of understanding the characteristics of different genres and their styles of reconstructing geometry.\n",
    "5_10": "To think outside of people's common sense, it is needed to construct a new understanding that allows the input information to be processed in a customized way.\n\n\nPaths are suggested tour ways of traveling through the palace, and by following them Fragments appear with filmic order, meaning that films are displayed again in geometrical way.\n\n\nA wander through the fragment palace is a wander through multiple versions of filmic urban spaces of Istanbul.\n\n\nThe facade showcased the scales of the Fragment Palace and the surronding area.\n\n\nBesides, the Fragment Palace create harmony in terms of scaling and atomosphere together with the buildings surrond.\n\n\nSimultaneously, depending on the order in which they traverse the paths, each viewer can construct their own film about the Palace.\n",
    "5_11": "Indeed, as I see it now, the way it appeared to my child’s eye, it is not a building, but it is quite dissolved and distributed inside me: here, one room, there another, and here a bit of corridor which, however, does not connect the two rooms, but is conserved in me in fragmentary form.\n\n\nIn contrast, Jacobs argued for the importance of social capital, which is linked to the physical form of the city, such as its streets, sidewalks, parks, and mix of uses.\n\n\nIs there a way to think outside of people's common sense of the city and look at the city in a different way?  Is it possible to look at the city through the lens of culture?.\n\n\nIn order to more intuitively distinguish fragments of films from different genres, different materials for the supporting structures have been utilized to connect and construct the entire \"fragment palace\" based on the style of each category.\n\n\nIn the Fragment Palace, in addition to the fragments and their supporting structures, as well as the wandering paths, there are also some hanging draperies.\n\n\nThese \"palace furniture\" elements enrich the sense of place within the palace.\n\n\nThe site is selected between two obelisks and a pillar-shaped sculpture, and the constructions make up for landscapes between the Fragment Palace.\n\n\nThe openess and  vacancy of the site contributes to a weak context, which provides a chance for laying the Fragment Palace and reconstruct its contexts.\n\n\nIn the Palace, clusters of fragments form an open-concept structure.\n\n\nHowever, these clusters are not randomly arranged within the space; rather, multiple paths guide the flow of people to explore the Palace from the perspective of film projection.\n\n\nFunctionally, the Palace is not just a static structure with a sculptural sense; it is also a dynamic entertainment palace that coexists with film.\n",
    "5_12": "Its essence is intricacy of sidewalk use, bringing with it a constant succession of eyes … The ballet of the good city sidewalk never repeats itself from place to place, and in any one place is always replete with improvisations.\n\n\nIts essence is intricacy of sidewalk use, bringing with it a constant succession of eyes … The ballet of the good city sidewalk never repeats itself from place to place, and in any one place is always replete with improvisations.\n\n\nAfter training our SOMs, we've essentially endowed these two personas with machine learning capabilities, creating a novel \"thinking pattern\" that deciphers cities in a transformative manner.\n\n\nThis allows the SOM to learn the underlying structure of the input data and organize it into clusters or groups.\n\n\nBecause of the inherent inaccuracies in machine learning, there is a tendency for outcomes to deviate from human-defined standards.\n\n\nThis intangible \"sense\" resists deconstruction through rational analysis, making employment of machine learning the most fitting approach for integration into design.\n\n\nThis SOM serves to reorganize the entirety of Istanbul's architectural elements, functioning as an unsupervised machine learning technique.\n\n\nInstead of working within the confines of a physical context, this project works within the realm of datasets, utilizing machine learning techniques.\n\n\nIn the pursuit of looking at the city through the lens of collective recollection, the initial step is to form an understanding of culture for the machine, exclusively using cultural products as the dataset.\n\n\nBy analyzing and learning from this archive, the machine is acquiring its own form of knowledge about the cultural products of Istanbul.\n",
    "5_13": "Taking inspiration from Italo Calvino's acclaimed work, \"Invisible Cities,\" and harnessing the power of machine learning, we've forged an innovative design methodology.\n\n\nA Self-Organizing Map (SOM) is a type of artificial neural network designed for unsupervised learning.\n\n\nOur project seeks to investigate and understand the influence of visual complexity stemming from Istanbul City on individual architectural elements, employing machine learning techniques to explore this relationship.\n\n\nThese images were then employed to train a Self-Organizing Map (SOM).\n\n\nBy employing Self-Organizing Maps (SOM) for classification and generating an interactive unsupervised machine learning model, we are empowered to categorize existing architectural pictures through a lens that draws inspiration from the affordances observed in Istanbul.\n\n\nThe fragments are organized in the space in three typical ways: Self-spinning, path-merging and collage.\n\n\nWith this method the fragment is organized as a sculptural construction for 360 degree exhibition.\n",
    "5_14": "The heart of the project lies in the curation of these objects.\n\n\nConcurrently, this methodology affords us the unique opportunity to engage in design through the pure medium of dialogue.\n\n\n\"But, actually, an affordance is neither an objective property nor a subjective property; or it is both if you like.\n\n\nAffordances are intricately linked with the local culture and the habitual ways of life of the inhabitants.\n\n\nAdditional applications of rooftop space have been showcased in prominent film sequences, further enriching the array of affordances associated with Istanbul's rooftops.\n\n\nThis process holds the potential to convey these architectural elements' affordance in a manner deeply rooted in the local culture, thus offering a novel and enriched perspective.\n\n\nUpon introducing the staircase component from the original project into Istanbul's narrative, an intriguing revelation takes shape.\n\n\nTherefore, this project is interested in repainting the forgotten spaces within the city.\n\n\nIn contrast to the conventional design projects, this project is not a proposal, but a design research experiment.\n\n\nIn this project, the structure generated from visual autoencoder outputs is populated with the coordinates and transformed according to the sound intensity.\n\n\nThe sound part of this project using autoencoder in the final Implementation for extracting meaningful cultural representations from ambient city.\n\n\nThe project is located in Sultanahmet Meydanı, a plaza with 40 meters width.\n",
    "5_15": "A constant dialogue exists between the various elements that constitute the city, from objects on the streets to buildings and monuments, all imbued with layers of cultural, social, and historical stories.\n\n\nThe large-scale smart cities projects of today can be seen as similar in that they seek to introduce a technologized infrastructure that dominates the heart of a city's neighborhoods.\n\n\nThis dialogue from two points of view in the book is very similar to our definition of the city as a conflict progress, hence we further deconstruct the book and use it as our methodology.\n\n\nIn our project, we focused on classifying architectural elements based on the taxonomy provided by Koolhaas's book \"Elements of Architecture.\n\n\nWe have developed a Self-Organizing Map (SOM) that undergoes training using images featuring architectural elements from Istanbul, following a similar methodology to the creation of personas for Marco Polo and Khan.\n\n\nThis methodology empowers us to systematically dissect the architectural compositions of various architects through the lens of Istanbul's distinctive context.\n\n\nAfter meticulous evaluation, we arrived at the decision to partner with an architectural firm renowned for a substantial portfolio and a distinctive design identity.\n\n\nThis integration allows for a fusion of OMA's architectural narratives with the context of Istanbul, creating a rich tapestry of design that captures both the essence of OMA's unique style and the distinctive spirit of Istanbul.\n\n\nWe can guess the affordance of the architectural element that Istanbul wants to express through similar categorizing elements.\n\n\nWhen integrated with geographical data-linked Google reviews, this methodology promptly unveils a distinct facet of Istanbul's urban panorama.\n\n\nIn contrast to various other architectural projects, our endeavor places a distinct emphasis on exploring the realms of design navigation solely through the potency of text.\n\n\nIn the second attempt at an encoder, the Autoencoder takes input, transforms it into an efficient internal representation, and then outputs \"analogues\" of the input Dataset.\n\n\nTake this scene for instance, it is masked through an automated procedure using SAM, then segmented into distinct parts accordingly.\n\n\nFinally, these output fragments are pieced together according to their original coordinates to reconstruct the scene through the lens of culture.\n\n\nIt offers the opportunity to delve into the city's rich history, culture, and social fabric, presenting Istanbul's various layers through different lenses and timelines.\n",
    "5_16": "To imbue this dialogue with contextual significance, it is imperative to embed the conversation within a robust spatial context.\n\n\nIt encapsulates the aesthetic essence and visual attributes of the space, encompassing elements such as spatial arrangement, architectural form, and sensory engagement.\n\n\nThrough extensive training on this rich dataset, the SOM acquired a comprehensive understanding of the architectural elements and their spatial relationships within the context of Istanbul.\n\n\nAfter finalizing our choice of OMA as the designated design host, we proceeded by constructing an extensive database encompassing detailed descriptions and comprehensive project information for all of OMA's architectural endeavors.\n\n\nThe architectural elements of Milstein Hall at Cornell University will be arranged by istanbul som and then reclassified as som deems appropriate.\n\n\nUnder each category, there are other architectural elements in Istanbul that Istanbul considers to be similar to the element.\n\n\nThese three spatial layers intersect and connect with each other throughout the city.\n\n\nIn terms of spatial quality, alley is a linear space surrounded by three sides.\n\n\nThe information received by the five senses within the three spatial layers shows different emphasis.\n\n\nTherefore, the three spatial layers at the same geographic coordinates may have very different sensory experiences.\n\n\nThey are encoded to a latent space, then decoded as outputs on the right.\n\n\nAlthough the process is relatively complete, there is still a lot of room for development in terms of the results of the 'reactivation' output.\n\n\nThe algorithm calculates the similarity of each piece that contains the same number of frames of each video in the film library, and outputs the clip that with the highest similarity score.\n",
    "5_17": "They also have their own intrinsic qualities and relations with other objects, influencing and affecting one another without losing their distinct identities.\n\n\n[3] One of the houses is now the library of the Çelik Gülersoy Foundation, an extraordinary collection of books, maps, engravings and paintings of Istanbul in Ottoman times.\n\n\nWithin one of the houses now stands the library of the Çelik Gülersoy Foundation, housing an exceptional assortment of books, maps, engravings, and paintings showcasing Istanbul during Ottoman times.\n\n\nIn the book, Calvino encourages readers to transcend their existing knowledge frames and to challenge their personal identity constraints through the interplay between Kublai Khan and Marco Polo's differing perspectives of the cities they encounter.\n\n\nLiterature serves as the foundation of our chosen conceptual landscape, functioning as the terrain we traverse guided by the perspectives of Marco Polo and Khan.\n\n\nThe extracted data, once cleaned and organized, provides a comprehensive perspective on architectural trends and urban typologies, aiding in better-informed urban design choices.\n",
    "5_18": "One house became the library of the Çelik Gülersoy Foundation, housing Istanbul’s Ottoman-era treasures.\n\n\nObjects have the power to change the context around them when one lets them start to communicate their stories.\n\n\nThe process is carried out again for another location on the same street.\n\n\nOne house became the library of the Çelik Gülersoy Foundation, housing Istanbul’s Ottoman-era treasures.\n\n\nOne house became the library of the Çelik Gülersoy Foundation, housing Istanbul’s Ottoman-era treasures.\n\n\n[5] The detective assigned to the snack bar subjected the granny’s cinnamon drink to yet another examination, and he also inspected the glasses, the heat-resistant holder on the crooked handles of the tin ladles, the change box, a number of rusty holes, and the employees’ hands for any sign of a strange powder.\n\n\n[7] The mosque itself, known as Fatih Camii,6 was the centre of a vast külliye, or complex of religious and philanthropic institutions of one kind or another, which together constituted a vakif, or pious foundation.\n\n\nThe heart of a religious and philanthropic complex, Fatih Camii, the mosque, stood as a testament to its pious foundation.\n\n\nThis manual method cannot reflect the characteristics of memory that varies from person to another.\n\n\nThese data are compressed and stored in the latent space of each model.\n\n\nThese datasets are compressed and stored in the latent space of each model.\n",
    "5_19": "A custom object detection model was trained based on a pre-trained model (YOLO).\n\n\nThe purpose of object detection was to understand the setting of the street objects.\n\n\nThe images shown are the results of the custom trained detection model.\n\n\nThe TF-IDF model is used to extract features from these vectors and is used to train a Self-Organising Map (SOM).\n\n\nThe custom-trained object detection model is used to detect objects that exist in the location.\n\n\nFor score mode, the model has the last out put layer which is trained on 400 different activities.\n\n\nOnce the model attained proficiency through training, it furnished us with a comprehensive perspective of Istanbul's urban fabric.\n\n\nThe full-degree viewing contributes to the accuracy of reconstructed model.\n\n\nIn this setting, different films provide different contexts for a hammam environment.\n",
    "5_20": "Each image was then labelled according to the different objects.\n\n\nAfter training the images, the model was used to test the efficiency of the model.\n\n\nThe 3D model is used as an input and the processed text is used as the prompt in Stable diffusion.\n\n\nA model of the object is used as an input in Blender, and rendered using Stable Diffusion.\n\n\nDifferent 3D Models of fountain are scraped from Sketchfab which are used to re-imagine it using Stable Diffusion on Blender.\n\n\nShap-E , a model that generates 3D objects using text and images as input, is used to produce a point cloud model and a mesh model based on the combined image.\n\n\nLondon is used as the city to experiment with this concept and used the objects of London and reimagined them through the text of Istanbul.\n\n\nThe mesh model is used as a base and fed into Mid-journey to visualise the mesh in Istanbul style.\n\n\nThe model is texturised using elements that stood out in the text.\n\n\nBy permuting and combining these basic elements, one could create different concrete cities.\n\n\nBy inputting descriptive city texts into these models, each SOM generates a respective urban policy reflecting its training.\n\n\nA dataset of 1000 images of Istanbul objects are created to train the model.\n\n\nAccordingly, Segment Anything Model (SAM) released in earlier 2023 is used to segment the collected art pieces and create a robust dataset composed of 3000 images for training the autoencoder model.\n\n\nBecause different people have different impressions of the same sound.\n\n\nThe sound clips of different instruments including jazz, piano, choral vocals, percussion, etc.\n\n\nThe clips are then converted into spectrograms and recorded as roughly 30,000 512*512 images for training the model.\n\n\nThe authors use the remaining keywords as prompt for stable diffusion to generate the new images.\n\n\nTherefore, when modeling the forgetting process, the tactile adjectives are deleted one by one according to their level of importance, then Stable Diffusion is used to generate the new textures according to the remaining adjectives.\n",
    "5_21": "Therefore, the authors try to model the process through a different approach for the second attempt.\n\n\nTherefore, in the second attempt, in order to model the process of encoding and information re-extraction in the brain, artificial neural network is used, Autoencoder for particular, for more explorations.\n\n\nTo model this process through \"visual\", an artificial neural network is employed, known as autoencoder.\n\n\nSimilar to the visual model, autoencoder is also used for the sound model to explore the process of remembering and forgetting through \"sound\".\n\n\nTherefore, in the first attempt, the authors model the process of remembering and forgetting by altering the tactile feature of the texture.\n\n\nAfterwards, the authors delete the keywords according to this order to model the forgetting process.\n",
    "5_22": "This process is carried out for all other objects in the location.\n\n\nUpon reaching the culmination of our workflow, we amass a multitude of elements poised to augment our design process.\n\n\nTo model the remembering and forgetting process from the visual perspective, the simulation is divided into two processes.\n\n\nThe process of constantly updating the images is the process of recalling.\n\n\nThe process of forgetting is placed alongside the process of recalling, to visualize how the images are updated to simulate the process of visualizing the absence of information in memory and the reconstruction during the different stages of forgetting.\n\n\nThe process of autoencoder is used to simulate the process of remembering, forgetting and reactivating.\n\n\nFrom the authors' own interpretation, the mechanism behind the qualitative notion of memory can be iterated through the process of remembering and forgetting.\n\n\nTo model the process of remembering and forgetting through 'sound', one audio fragment is firstly chosen that was recorded when someone was walking down the street in Istanbul, while there’s the broadcasting of 'call to prayer' going on in the background.\n\n\nTherefore, to model the process of remembering and forgetting, the classified matching sound is added one by one into the original sound file accordingly to simulate the forgetting process.\n\n\nIn the second attempt, the process of 'receive-forget-reactivate' is simulated.\n\n\nIn the fourth attempt, the authors focused on modifying the \"reactivating process\".\n\n\nFor the second attempt, the authors aim at incorporating the recalling of the memory into the process.\n\n\nMeanwhile, realizing that the remembering and forgetting process can be improved.\n\n\nTo improve the process regarding that, in the second attempt, the authors come up with a method using AI to generate the tactile feelings instead.\n\n\nTo model the remembering and forgetting process through \"touch\", the stone road texture is taken as an example.\n\n\nTo model the recalling process, use the last texture image of the forgetting process as the starting point of memory recalling.\n",
    "5_23": "The renovation process sought to strike a delicate balance between preserving the authenticity of the hamam and adapting it to meet contemporary expectations of accessibility and cultural sensitivity.\n\n\nEfforts were made to incorporate eco-friendly practices and technologies into the revitalization process.\n\n\nThen python is used to analyze the audio file and classify the content within this audio fragment, which can be seen as the feature of the audio file.\n\n\nSecondly, the process of 'reactivating' are taken into consideration and used to define where the 'reactivating' should start.\n\n\nIn order to make this process more randomized, the authors wrote python codes to implement the process of 'randomly screen audio from the AudioSet database - compare audio purity and sort the groups - randomly screen audio again in the optimal group'.\n\n\nIn the process of \"reactivating memory\", the authors analyze the grayscale data of the sound, based on this, they use randomly selected audio from the AudioSet to generate new sounds, and stitch them into a new audio.\n\n\nWrite a piece of code to extract audio clips that match the target class from AudioSet.\n\n\nCombine the previously organized audio to generate a new audio.\n\n\nAnalyzing this audio, it can be found that its grayscale data and class are very similar to the original input audio, but it sounds completely different.\n\n\nThis process of piecing together sound fragments is like picking up fragments of memory.\n\n\nGranular Synthesis is a sound processing technique that involves chopping up a piece of audio into teeny-tiny particle fragments called “grains”.\n\n\nCombine the previously organized audio to generate a new audio.\n\n\nAnalyzing this audio, it can be found that its grayscale data and class are very similar to the original input audio, but it sounds completely different.\n\n\nThe process of analyzing and extracting each piece of sound data as before is too inefficient.\n\n\nAt the start of the forgetting process, all the detail feelings are remembered.\n",
    "5_24": "The ArcGIS coordinates were used to scrape out Google StreetView images.\n\n\n200 images for each category of object were scraped in order to make an initial training dataset to perform object detection.\n\n\nObject Detection was performed on images scraped from Google Street view using the coordinates of the objects.\n\n\nMultiple 3D models are scraped out from SketchFab that gave a wide range of iterations of the same object.\n\n\nThen the crystal glasses inside would shudder along with the porcelain and the silver sugar bowls, the liqueur sets, the never-used coffee cups, the old clock, the silver lighter that no longer worked, the little glass vase with the spiraling floral pattern whose likeness one could see displayed on the buffet of any middle-class family in the city, other assorted ornamental pieces, and finally the buffet’s glass shelves.\n\n\n[1] Then the crystal glasses inside would shudder along with the porcelain and the silver sugar bowls, the liqueur sets, the never-used coffee cups, the old clock, the silver lighter that no longer worked, the little glass vase with the spiraling floral pattern whose likeness one could see displayed on the buffet of any middle-class family in the city, other assorted ornamental pieces, and finally the buffet’s glass shelves.\n\n\nThen the crystal glasses inside would shudder along with the porcelain and the silver sugar bowls, the liqueur sets, the never-used coffee cups, the old clock, the silver lighter that no longer worked, the little glass vase with the spiraling floral pattern whose likeness one could see displayed on the buffet of any middle-class family in the city, other assorted ornamental pieces, and finally the buffet’s glass shelves.\n\n\nThen the crystal glasses inside would shudder along with the porcelain and the silver sugar bowls, the liqueur sets, the never-used coffee cups, the old clock, the silver lighter that no longer worked, the little glass vase with the spiraling floral pattern whose likeness one could see displayed on the buffet of any middle-class family in the city, other assorted ornamental pieces, and finally the buffet’s glass shelves.\n\n\nBy scraping the website, we scraped all relevant categories, their specific types, and descriptions.\n\n\nThrough this process, independent high-quality databases can be built for each sound category.\n",
    "5_25": "Digital tools were used to understand the street life and elements of Istanbul.\n\n\n“…one can easily see in an object at once a perfection and an absence of origin, a closure and a brilliance, a transformation of life into matter (matter is much more magical than life), and in a word a silence which belongs to the realm of fairy-tales.\n\n\n[6] FINE cities containing not a single dilapidated public building, a solitary weed-strewn building lot, or even a crumbling palazzo; but a great city must have them all, for decay, too, is a sign of life.\n\n\nFINE cities containing not a single dilapidated public building, a solitary weed-strewn building lot, or even a crumbling palazzo; but a great city must have them all, for decay, too, is a sign of life.\n\n\nA central focus of her study was the role of everyday street life in urban areas, referred to as \"sidewalk ballet.\n\n\nI’ve spent my life either battling with this melancholy or (like all İstanbullus) making it my own.\n\n\nThe book is structured as a series of chapters, each one focusing on a different aspect of Istanbul, from its iconic landmarks to its vibrant street life and rich literary traditions.\n\n\norhan's prose is poetic and evocative, bringing the sights, sounds, and smells of Istanbul to life on the page.\n\n\nBy identifying actors and drafting scripts, we delineate the dynamic interplay of activities, functions, and events that breathe life into the envisioned urban realm.\n\n\nWe begin with scraping documentaries centered on Istanbul's street life, ensuring each features clear visuals and high resolution for optimal action classification.\n\n\nThis captivating phenomenon underscores the inherent beauty of our approach—one that breathes fresh life into objects that had been previously confined within predetermined definitions.\n\n\nThe transformation from photography to film as the chosen medium for capturing urban life is seen over time.\n\n\nThe whole process is about finding relationship and build connection between Path, Film clip and Geometry.\n\n\nAll the film clips come from the film database we built before.\n\n\nThe Fragments are reconstructed filmic space geometries, and are built through 3d reconstruction software with frames from the film clips.\n\n\nFilm clip shown on the curtain is from 'The Accidental Spy'.\n",
    "5_26": "Objects possess materiality, but at the same time they are cultural and imagined.\n\n\nThe objects in the museum symbolize Kemal and Fusun’s relationship, as well as broader themes such as the passage of time and the importance of memory.\n\n\nEach book is converted into a text file  and is broken down into sentences.\n\n\nEach sentence is then labelled as an individual text file corresponding to the keyword.\n\n\nA single sentence from the sentences extracted is used as a prompt and “not Istanbul” is used as a negative prompt in the rendereing process.\n\n\nThe reconstructed mesh is taken as the base and associated with the space in real-time.\n\n\nBased on the links established in PCA, sentences are put together to form a combined sentence, which is used as a prompt.\n\n\nThe Karaköy bridge’s clocks deceived, toying with time and hope.\n\n\nThe combined sentences are processed to get  adjectives and phrases that curated a list of keywords which are used as prompts.\n\n\nThe combined sentences are further processed and are used as prompts in stable diffusion to derive the initial scene.\n\n\nTo show the influence of an object in the scene, the sentences within the cells are processed based on PCA and the closely related sentences are used as a prompt and the scene is reimagined.\n\n\nAs we are re using text resources from urban theory books, the BMU would represent patterns or themes present in those sentences.\n\n\nFor example, if there's a frequent theme in urban theory about \"public spaces,\" then one of the BMUs might have weights that make it most responsive to sentences discussing public spaces.\n\n\nWhen we input a sentence about public spaces, this BMU would likely be the one activated.\n\n\nAlthough some details will be lost, it is enough to return to the scene at that time.\n\n\nAs time goes by, the least important details are getting forgotten, and then the less important details get forgotten bit by bit.\n\n\nThrough extracting frames from film clip we can get the geometry through reality capture.\n",
    "5_27": "Its streets are adorned with a plethora of objects, each holding a unique story that contributes to the city’s vibrant tapestry.\n\n\nBooks allow for more in-depth exploration of topics and themes, and often includes vivid descriptions of scenes and environments, allowing readers to envision the scenes and objects described in the text.\n\n\nThis unique mechanism enables the preservation of data relationships and facilitates intuitive visualizations.\n\n\nIn a trained SOM, each BMU will be associated with a particular type of sentence or theme from the corpus, which can allow us to 'translate' our own input into opinion of Kubla Khan and Macro Polo.\n\n\nThis revelation is akin to uncovering fifty-five concealed cities within the metropolis, each emanating its unique essence.\n\n\nWhen inputting an ambient sound, the sound will get a cultural translation of the surrounding environment as it passes through the latent space.\n\n\nWhen feeding an ambient sound into the model, the sound will get a cultural translation of the surrounding environment as it passes through the latent space.\n\n\nIn some films the mosuqe is the environment background of the story, whereas in other films the mosque is the main subject of their theme.\n\n\nArthouse films tell the story of lives, the unique view and sentimental feelings that people grow with city.\n",
    "5_28": "This project embarks on a transformative journey, shaping urban environments that transcend the ordinary and resonate with the intrinsic essence of objects, thereby creating cities that are both aesthetically enchanting and deeply meaningful to the people who inhabit them.\n\n\nAs argued in the previous chapter, the urban environment is characterized by an ongoing interplay of contradictions.\n\n\nMoreover, Polo believed that cities did not follow any rules but were the product of imagination, chance, and contingency, leading to unique and fragmented cities that defy generalization, summary, or abstraction.\n\n\nSimilar to the 55 cities depicted in \"Invisible Cities,\" Orhan Pamuk's memoir \"Istanbul: Memories and the City\" presents a unique interpretation of Istanbul.\n\n\nIt also involves assessing whether these elements should be influenced by the larger system environment.\n\n\nAll buildings within a city might be impacted by a cohesive and indescribable \"style\" that contributes to the broader urban ambience.\n\n\nIt is equally a fact of the environment and a fact of behavior.\n\n\nOne of the reasons behind is that when people were growing up, the existing surrounding urban environment has told them what cities are like, people have the basic idea about how a city should look like.\n\n\nSubsequently, as the next generation comes of age within these architecturally guided environments, they inherit this ingrained perception.\n\n\nTherefore, the next step is to reintroduce the previously classified and stored grayscale data.\n\n\nIt can be found that the analysis diagram has hardly changed from the previous step.\n\n\nBecause in the previous experiments it can be found that the acoustic environment of the city is very complex.\n\n\nA hammam environment with possible activities playing on the curtain.\n",
    "5_29": "She developed a thesis valuing small-scale city neighborhoods and their unique elements and character, and drew evidence from her own neighborhood to show its transferability to other urban contexts.\n\n\nThe book is structured as a series of conversations between the aging explorer Marco Polo and the young emperor Kublai Khan, in which Marco Polo describes the 55 cities he has visited on his travels.\n\n\nSpecifically, Calvino employs the contrasting views of the Empire of Diamond and the City of Meaning to facilitate this process, leading readers to reach a point of \"uncovering\" and engage in a re-examination of the issue of space.\n\n\nHe believed that the city could be divided into immeasurably small elements, such as walls, streets, houses, rivers, bridges, ports, cliffs, wars, sadness, happiness, etc.\n\n\nKublai Khan sent Marco Polo to find the cities he had imagined, believing that the combination of these basic elements had certain laws that, once mastered, could allow for the ultimate calculation of the form of all cities to be made in an unchanging manner.\n\n\nThis understanding of the city arose from Kublai Khan's imperial role, which required him to manage a vast empire, and he believed that by discovering the constant elements that made up the city and finding the laws of its composition, he could keep an eye on everything that was going on in the Empire without ever leaving his home.\n\n\nIn his view, this discovery could be solidified into knowledge to guide others and consolidate the empire.\n\n\nMarco Polo, as a merchant, vassal, and traveler, perceived cities as complex and ever-changing entities.\n\n\nHe argued that cities were not composed of constant basic elements, but of numerous exceptions, uncertainties, illogicalities, and contradictions.\n\n\nEven seemingly constant elements such as walls, streets, and houses could be altered beyond recognition by a slight change of era or descriptor.\n\n\nPolo's city, thus, represents an unanswerable surface that raises questions that force answers, forming an ever-expanding, endless web of meaning that hangs over the city.\n\n\nHence, Marco Polo's view of the city represents a stark contrast to Kublai Khan's ordered and precise conception and presents an unanswerable challenge to those who seek to understand the infinite complexities of urban life.\n\n\n\" For me it has always been a city of ruins and of end-of-empire melancholy.\n\n\nThe main reason driving the decline of Istiklal Street is the changing economic and social conditions of the city.\n\n\nThis leads to some changes in the content of each recall.\n\n\nBreak this sound into very small fragments, but don't change the order of the fragments temporarily.\n",
    "5_30": "Kemal collects objects that represent different periods in Istanbul’s history, creating a microcosm of the city that showcases its social and political changes over time.\n\n\nWhen one attempts to read the city through the objects on the streets, they transform themselves into story-telling devices and represent a collection of shared values and experiences.\n\n\nThis discourse between Kublai Khan and Marco Polo can be regarded as a quintessential representation of urban prototype, drawing from universal urban theories as their foundation.\n\n\nThey constitute a facet of urban complexity, a collective understanding and viewpoint ingrained in the local populace's subconscious—an essence that eludes easy verbal articulation.\n\n\nIt scrutinizes the collection of images, subsequently reclassifying them without being confined to the constraints of predetermined categories.\n\n\nThe output from the SOM reveals a collection of images belonging to a particular family, which is notably associated with circulation and vertical movement.\n\n\nThe output from the SOM reveals a collection of images belonging to a particular family, which is notably associated with load-bearing and space framing.\n\n\nThe decision to renovate the Hürrem Sultan Hamamı stemmed from a collective desire to protect and revive this architectural gem, which held immense historical and cultural value.\n\n\nThe main reason for the decline of the Tarlabasi neighborhood is the urban transformation that the area underwent in the 20th century.\n\n\nTo be more precise, the entire design is situated within latent space formed by encoding the environment through the datasets we collected.\n\n\nAs a city, Istanbul is an area suitable for cinema.\n",
    "5_31": "They go beyond their utilitarian purposes to embody cultural significance and collective memory.\n\n\nWhile the urban prototype we have meticulously crafted can indeed resonate with personal memories entrenched in the Istanbul milieu, our approach has been particularly deliberate in the curation of literary sources that encapsulate the collective consciousness of this remarkable city.\n\n\nHowever, following meticulous deliberation, it became evident that none of these sources possessed the capacity to authentically embody the collective memories woven into the fabric of Istanbul's successive generations, while simultaneously achieving the rational portrayal of its urban landscapes and the poignant evocation of its reminiscences.\n\n\nIt's a numerical statistic used to reflect how important a word is to a document in a collection or corpus.\n\n\nIt's a statistical measure used to evaluate how important a word is to a document in a collection or corpus.\n\n\nThis trove of data was meticulously curated from sources such as ArchDaily, complemented by an extensive collection of corresponding architectural project images.\n\n\nRealizing that memories are collected through the five senses: sound, smell, visual, touch, and taste.\n\n\nIn the second attempt, raw sound data on the streets of Istanbul are collected and the AudioSet database is used as a source for newly added audio.\n",
    "5_32": "This includes various media like text, images, 3D models and videos.\n\n\nHigh in the little balcony of the minaret he stands like a pre- centor leading the hymns of the people ; and the temple in which he has taken his stand is limited by the starry dome of heaven alone.\n\n\nHigh in the little balcony of the minaret he stands like a precentor leading the hymns of the people.\n\n\nThe street is reconstructed using photogrammetry by using a walking tour video as the source for extracting 3D information.\n\n\nLeveraging a fine-tuned action classification model, we discern the three dominant actions from every video clip.\n\n\nFor video classification and searching In this part the model used for video classificationis a pytorch code for video (action) classification using 3D ResNet.\n\n\nFor feature mode, the function aims to find video segments that are similar to a short video cut.\n\n\nThis can be useful, for example, to search for multiple similar video clips in a video library.\n\n\nBy comparing the characteristics of the short video cut with the features of the videos in the library, the function can identify the most similar ones.\n\n\nHowever, the classification model assess action without any understanding of what the video is about, so the result sometime is not so accurate.\n\n\nWe can also link video into another library of art videos by video feature classification model and use it as a moodboard.\n\n\nIn this way, we can identify artistic videos that resonate with our original video.\n\n\nThe juxtaposition provides a new lens through which the original video can be viewed, enhancing its interpretive depth.\n\n\nIn order to better study the urban acoustic environment from a cultural perspective, this project uses tens of thousands of music clips to train the low-frequency, mid-frequency and high-frequency models of autoencoder.\n\n\nFor instance, low frequencies might capture the rumble of a subway or a distant drum, while high frequencies could encapsulate the chirping of birds or the chime of a street performer's instrument.\n\n\nFor instance, low frequencies might capture the rumble of a subway or a distant drum, while high frequencies could encapsulate the chirping of birds or the chime of a street performer's instrument.\n\n\nThis project uses tens of thousands of music clips to train the low-frequency, mid-frequency and high-frequency models of autoencoder.\n\n\nIn the whole design process, there are 3 fundamental elements we use to design with: Path, Video and Geometry.\n\n\nThe original video can be gotten in anywhere in the city with any city scene, then the 4 film version of this urban scene can be searched using the video classification model.\n\n\nTravel videos are connected by conjunctive video clips as an film editing for displaying filmic images of Istanbul.\n\n\nThe editing technique of montage introduces the video narrativity and absurdity.\n\n\nImage classification model and video classification model are used respectively for scene recognition and activity recognition.\n\n\nTake the mosque as an example, as the scene is inputted, figures as mosque are recognized from each video clip.\n\n\nFor videos in which the activities need highlighting, the video is directly inputted as the original video for the video classification model.\n\n\nTake drinking coffee as an example, an eight-second-long original video is inputted, and one eight-second-long video clip of drinking coffee are extracted from each film libraries.\n\n\nFirstly, 3d reconstructions are made for the four versions of the original videos.\n\n\nThe video is an overall display of the four groups of landscapes as well as their filmic context, making it possible to dive into the merging between multiple versions.\n\n\nA small experiment is made to merge the four versions from one original video.\n\n\nPath-merging method is applied to four fragments reconstructed from four versions of one original video.\n\n\nFragment collage method works without path, and is applied to four fragments reconstructed from four versions of one original video.\n"
}